[
  {
    "date": "2025-10-01",
    "type": "morning",
    "title": "Guarded by Peace",
    "verse_ref": "Philippians 4:6–7",
    "verse_text": "The peace of God will guard your hearts and minds in Christ Jesus.",
    "encouragement_intro": "This reminds me that guarded by peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GUARDED BY PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s GUARDED BY PEACE from my life.",
    "point3": "💫 I WILL live and speak GUARDED BY PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GUARDED BY PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Philippians 4:6–7. Help me walk in guarded by peace today."
  },
  {
    "date": "2025-10-02",
    "type": "morning",
    "title": "Peace in Trouble",
    "verse_ref": "John 16:33",
    "verse_text": "In Me you may have peace… Take heart; I have overcome the world.",
    "encouragement_intro": "This reminds me that peace in trouble is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PEACE IN TROUBLE.",
    "point2": "💫 I REFUSE to let anything steal God’s PEACE IN TROUBLE from my life.",
    "point3": "💫 I WILL live and speak PEACE IN TROUBLE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PEACE IN TROUBLE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 16:33. Help me walk in peace in trouble today."
  },
  {
    "date": "2025-10-03",
    "type": "morning",
    "title": "Peace Rules My Heart",
    "verse_ref": "Colossians 3:15",
    "verse_text": "Let the peace of Christ rule in your hearts.",
    "encouragement_intro": "This reminds me that peace rules my heart is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PEACE RULES MY HEART.",
    "point2": "💫 I REFUSE to let anything steal God’s PEACE RULES MY HEART from my life.",
    "point3": "💫 I WILL live and speak PEACE RULES MY HEART boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PEACE RULES MY HEART with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Colossians 3:15. Help me walk in peace rules my heart today."
  },
  {
    "date": "2025-10-04",
    "type": "morning",
    "title": "Be Still and Know",
    "verse_ref": "Psalm 46:10",
    "verse_text": "Be still, and know that I am God.",
    "encouragement_intro": "This reminds me that be still and know is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in BE STILL AND KNOW.",
    "point2": "💫 I REFUSE to let anything steal God’s BE STILL AND KNOW from my life.",
    "point3": "💫 I WILL live and speak BE STILL AND KNOW boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry BE STILL AND KNOW with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 46:10. Help me walk in be still and know today."
  },
  {
    "date": "2025-10-05",
    "type": "morning",
    "title": "Trust that Steadies",
    "verse_ref": "Proverbs 3:5–6",
    "verse_text": "Trust in the Lord… He will make your paths straight.",
    "encouragement_intro": "This reminds me that trust that steadies is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in TRUST THAT STEADIES.",
    "point2": "💫 I REFUSE to let anything steal God’s TRUST THAT STEADIES from my life.",
    "point3": "💫 I WILL live and speak TRUST THAT STEADIES boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry TRUST THAT STEADIES with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Proverbs 3:5–6. Help me walk in trust that steadies today."
  },
  {
    "date": "2025-10-06",
    "type": "morning",
    "title": "Upheld by God",
    "verse_ref": "Isaiah 41:10",
    "verse_text": "Do not fear, for I am with you… I will uphold you.",
    "encouragement_intro": "This reminds me that upheld by god is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in UPHELD BY GOD.",
    "point2": "💫 I REFUSE to let anything steal God’s UPHELD BY GOD from my life.",
    "point3": "💫 I WILL live and speak UPHELD BY GOD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry UPHELD BY GOD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Isaiah 41:10. Help me walk in upheld by god today."
  },
  {
    "date": "2025-10-07",
    "type": "morning",
    "title": "Unshakable Hope",
    "verse_ref": "Psalm 62:5–6",
    "verse_text": "My hope comes from Him… He is my fortress; I will not be shaken.",
    "encouragement_intro": "This reminds me that unshakable hope is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in UNSHAKABLE HOPE.",
    "point2": "💫 I REFUSE to let anything steal God’s UNSHAKABLE HOPE from my life.",
    "point3": "💫 I WILL live and speak UNSHAKABLE HOPE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry UNSHAKABLE HOPE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 62:5–6. Help me walk in unshakable hope today."
  },
  {
    "date": "2025-10-08",
    "type": "morning",
    "title": "Peace at All Times",
    "verse_ref": "2 Thessalonians 3:16",
    "verse_text": "The Lord of peace Himself give you peace at all times and in every way.",
    "encouragement_intro": "This reminds me that peace at all times is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PEACE AT ALL TIMES.",
    "point2": "💫 I REFUSE to let anything steal God’s PEACE AT ALL TIMES from my life.",
    "point3": "💫 I WILL live and speak PEACE AT ALL TIMES boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PEACE AT ALL TIMES with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Thessalonians 3:16. Help me walk in peace at all times today."
  },
  {
    "date": "2025-10-09",
    "type": "morning",
    "title": "Joy & Peace in Believing",
    "verse_ref": "Romans 15:13",
    "verse_text": "May the God of hope fill you with all joy and peace as you trust in Him.",
    "encouragement_intro": "This reminds me that joy & peace in believing is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in JOY & PEACE IN BELIEVING.",
    "point2": "💫 I REFUSE to let anything steal God’s JOY & PEACE IN BELIEVING from my life.",
    "point3": "💫 I WILL live and speak JOY & PEACE IN BELIEVING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry JOY & PEACE IN BELIEVING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Romans 15:13. Help me walk in joy & peace in believing today."
  },
  {
    "date": "2025-10-10",
    "type": "morning",
    "title": "Help from the Lord",
    "verse_ref": "Psalm 121:1–2",
    "verse_text": "My help comes from the Lord, the Maker of heaven and earth.",
    "encouragement_intro": "This reminds me that help from the lord is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HELP FROM THE LORD.",
    "point2": "💫 I REFUSE to let anything steal God’s HELP FROM THE LORD from my life.",
    "point3": "💫 I WILL live and speak HELP FROM THE LORD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HELP FROM THE LORD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 121:1–2. Help me walk in help from the lord today."
  },
  {
    "date": "2025-10-11",
    "type": "morning",
    "title": "Delivered from Fear",
    "verse_ref": "Psalm 34:4",
    "verse_text": "I sought the Lord, and He delivered me from all my fears.",
    "encouragement_intro": "This reminds me that delivered from fear is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in DELIVERED FROM FEAR.",
    "point2": "💫 I REFUSE to let anything steal God’s DELIVERED FROM FEAR from my life.",
    "point3": "💫 I WILL live and speak DELIVERED FROM FEAR boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry DELIVERED FROM FEAR with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 34:4. Help me walk in delivered from fear today."
  },
  {
    "date": "2025-10-12",
    "type": "morning",
    "title": "Rest for Your Soul",
    "verse_ref": "Matthew 11:28–29",
    "verse_text": "Come to Me… and you will find rest for your souls.",
    "encouragement_intro": "This reminds me that rest for your soul is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in REST FOR YOUR SOUL.",
    "point2": "💫 I REFUSE to let anything steal God’s REST FOR YOUR SOUL from my life.",
    "point3": "💫 I WILL live and speak REST FOR YOUR SOUL boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry REST FOR YOUR SOUL with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 11:28–29. Help me walk in rest for your soul today."
  },
  {
    "date": "2025-10-13",
    "type": "morning",
    "title": "Blessed with Peace",
    "verse_ref": "Psalm 29:11",
    "verse_text": "The Lord gives strength… the Lord blesses His people with peace.",
    "encouragement_intro": "This reminds me that blessed with peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in BLESSED WITH PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s BLESSED WITH PEACE from my life.",
    "point3": "💫 I WILL live and speak BLESSED WITH PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry BLESSED WITH PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 29:11. Help me walk in blessed with peace today."
  },
  {
    "date": "2025-10-14",
    "type": "morning",
    "title": "Christ, Our Peace",
    "verse_ref": "Ephesians 2:14",
    "verse_text": "He Himself is our peace.",
    "encouragement_intro": "This reminds me that christ, our peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in CHRIST, OUR PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s CHRIST, OUR PEACE from my life.",
    "point3": "💫 I WILL live and speak CHRIST, OUR PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry CHRIST, OUR PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Ephesians 2:14. Help me walk in christ, our peace today."
  },
  {
    "date": "2025-10-15",
    "type": "morning",
    "title": "Dwelling in Safety",
    "verse_ref": "Psalm 91:1–2",
    "verse_text": "Whoever dwells in the shelter of the Most High will rest in the Almighty.",
    "encouragement_intro": "This reminds me that dwelling in safety is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in DWELLING IN SAFETY.",
    "point2": "💫 I REFUSE to let anything steal God’s DWELLING IN SAFETY from my life.",
    "point3": "💫 I WILL live and speak DWELLING IN SAFETY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry DWELLING IN SAFETY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 91:1–2. Help me walk in dwelling in safety today."
  },
  {
    "date": "2025-10-16",
    "type": "morning",
    "title": "Casting Anxiety",
    "verse_ref": "1 Peter 5:7",
    "verse_text": "Cast all your anxiety on Him because He cares for you.",
    "encouragement_intro": "This reminds me that casting anxiety is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in CASTING ANXIETY.",
    "point2": "💫 I REFUSE to let anything steal God’s CASTING ANXIETY from my life.",
    "point3": "💫 I WILL live and speak CASTING ANXIETY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry CASTING ANXIETY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 1 Peter 5:7. Help me walk in casting anxiety today."
  },
  {
    "date": "2025-10-17",
    "type": "morning",
    "title": "Hope & Future",
    "verse_ref": "Jeremiah 29:11",
    "verse_text": "Plans to prosper you and not to harm you, to give you a future and a hope.",
    "encouragement_intro": "This reminds me that hope & future is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HOPE & FUTURE.",
    "point2": "💫 I REFUSE to let anything steal God’s HOPE & FUTURE from my life.",
    "point3": "💫 I WILL live and speak HOPE & FUTURE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HOPE & FUTURE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Jeremiah 29:11. Help me walk in hope & future today."
  },
  {
    "date": "2025-10-18",
    "type": "morning",
    "title": "Commit & Be Still",
    "verse_ref": "Psalm 37:5–7",
    "verse_text": "Commit your way to the Lord… be still before Him and wait patiently.",
    "encouragement_intro": "This reminds me that commit & be still is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in COMMIT & BE STILL.",
    "point2": "💫 I REFUSE to let anything steal God’s COMMIT & BE STILL from my life.",
    "point3": "💫 I WILL live and speak COMMIT & BE STILL boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry COMMIT & BE STILL with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 37:5–7. Help me walk in commit & be still today."
  },
  {
    "date": "2025-10-19",
    "type": "morning",
    "title": "Never Forsaken",
    "verse_ref": "Hebrews 13:5–6",
    "verse_text": "I will never leave you nor forsake you… The Lord is my helper.",
    "encouragement_intro": "This reminds me that never forsaken is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in NEVER FORSAKEN.",
    "point2": "💫 I REFUSE to let anything steal God’s NEVER FORSAKEN from my life.",
    "point3": "💫 I WILL live and speak NEVER FORSAKEN boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry NEVER FORSAKEN with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Hebrews 13:5–6. Help me walk in never forsaken today."
  },
  {
    "date": "2025-10-20",
    "type": "morning",
    "title": "Wisdom for the Path",
    "verse_ref": "James 1:5",
    "verse_text": "If any of you lacks wisdom, ask God… and it will be given.",
    "encouragement_intro": "This reminds me that wisdom for the path is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in WISDOM FOR THE PATH.",
    "point2": "💫 I REFUSE to let anything steal God’s WISDOM FOR THE PATH from my life.",
    "point3": "💫 I WILL live and speak WISDOM FOR THE PATH boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry WISDOM FOR THE PATH with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in James 1:5. Help me walk in wisdom for the path today."
  },
  {
    "date": "2025-10-21",
    "type": "morning",
    "title": "Rooted & Fruitful",
    "verse_ref": "Psalm 1:2–3",
    "verse_text": "Like a tree planted by streams of water… prospers in season.",
    "encouragement_intro": "This reminds me that rooted & fruitful is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in ROOTED & FRUITFUL.",
    "point2": "💫 I REFUSE to let anything steal God’s ROOTED & FRUITFUL from my life.",
    "point3": "💫 I WILL live and speak ROOTED & FRUITFUL boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry ROOTED & FRUITFUL with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 1:2–3. Help me walk in rooted & fruitful today."
  },
  {
    "date": "2025-10-22",
    "type": "morning",
    "title": "Righteous Peace",
    "verse_ref": "Isaiah 32:17",
    "verse_text": "The effect of righteousness will be peace… quietness and trust forever.",
    "encouragement_intro": "This reminds me that righteous peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in RIGHTEOUS PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s RIGHTEOUS PEACE from my life.",
    "point3": "💫 I WILL live and speak RIGHTEOUS PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry RIGHTEOUS PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Isaiah 32:17. Help me walk in righteous peace today."
  },
  {
    "date": "2025-10-23",
    "type": "morning",
    "title": "Grace Abounds",
    "verse_ref": "2 Corinthians 9:8",
    "verse_text": "God is able to bless you abundantly… in all things at all times.",
    "encouragement_intro": "This reminds me that grace abounds is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GRACE ABOUNDS.",
    "point2": "💫 I REFUSE to let anything steal God’s GRACE ABOUNDS from my life.",
    "point3": "💫 I WILL live and speak GRACE ABOUNDS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GRACE ABOUNDS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Corinthians 9:8. Help me walk in grace abounds today."
  },
  {
    "date": "2025-10-24",
    "type": "morning",
    "title": "Sustained by God",
    "verse_ref": "Psalm 55:22",
    "verse_text": "Cast your cares on the Lord and He will sustain you.",
    "encouragement_intro": "This reminds me that sustained by god is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in SUSTAINED BY GOD.",
    "point2": "💫 I REFUSE to let anything steal God’s SUSTAINED BY GOD from my life.",
    "point3": "💫 I WILL live and speak SUSTAINED BY GOD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry SUSTAINED BY GOD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 55:22. Help me walk in sustained by god today."
  },
  {
    "date": "2025-10-25",
    "type": "morning",
    "title": "Troubled Heart, Trusting Heart",
    "verse_ref": "John 14:1",
    "verse_text": "Do not let your hearts be troubled. Believe in God; believe also in Me.",
    "encouragement_intro": "This reminds me that troubled heart, trusting heart is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in TROUBLED HEART, TRUSTING HEART.",
    "point2": "💫 I REFUSE to let anything steal God’s TROUBLED HEART, TRUSTING HEART from my life.",
    "point3": "💫 I WILL live and speak TROUBLED HEART, TRUSTING HEART boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry TROUBLED HEART, TRUSTING HEART with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 14:1. Help me walk in troubled heart, trusting heart today."
  },
  {
    "date": "2025-10-26",
    "type": "morning",
    "title": "Working for Good",
    "verse_ref": "Romans 8:28",
    "verse_text": "In all things God works for the good of those who love Him.",
    "encouragement_intro": "This reminds me that working for good is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in WORKING FOR GOOD.",
    "point2": "💫 I REFUSE to let anything steal God’s WORKING FOR GOOD from my life.",
    "point3": "💫 I WILL live and speak WORKING FOR GOOD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry WORKING FOR GOOD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Romans 8:28. Help me walk in working for good today."
  },
  {
    "date": "2025-10-27",
    "type": "morning",
    "title": "Trusting His Name",
    "verse_ref": "Psalm 20:7",
    "verse_text": "Some trust in chariots… but we trust in the name of the Lord.",
    "encouragement_intro": "This reminds me that trusting his name is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in TRUSTING HIS NAME.",
    "point2": "💫 I REFUSE to let anything steal God’s TRUSTING HIS NAME from my life.",
    "point3": "💫 I WILL live and speak TRUSTING HIS NAME boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry TRUSTING HIS NAME with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 20:7. Help me walk in trusting his name today."
  },
  {
    "date": "2025-10-28",
    "type": "morning",
    "title": "Fruit of Peace",
    "verse_ref": "Galatians 5:22–23",
    "verse_text": "The fruit of the Spirit is love, joy, peace…",
    "encouragement_intro": "This reminds me that fruit of peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in FRUIT OF PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s FRUIT OF PEACE from my life.",
    "point3": "💫 I WILL live and speak FRUIT OF PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry FRUIT OF PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Galatians 5:22–23. Help me walk in fruit of peace today."
  },
  {
    "date": "2025-10-29",
    "type": "morning",
    "title": "Strength to Endure",
    "verse_ref": "Colossians 1:11",
    "verse_text": "Strengthened with all power… for great endurance and patience.",
    "encouragement_intro": "This reminds me that strength to endure is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in STRENGTH TO ENDURE.",
    "point2": "💫 I REFUSE to let anything steal God’s STRENGTH TO ENDURE from my life.",
    "point3": "💫 I WILL live and speak STRENGTH TO ENDURE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry STRENGTH TO ENDURE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Colossians 1:11. Help me walk in strength to endure today."
  },
  {
    "date": "2025-10-30",
    "type": "morning",
    "title": "Kept from Stumbling",
    "verse_ref": "Jude 24",
    "verse_text": "To Him who is able to keep you from stumbling…",
    "encouragement_intro": "This reminds me that kept from stumbling is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in KEPT FROM STUMBLING.",
    "point2": "💫 I REFUSE to let anything steal God’s KEPT FROM STUMBLING from my life.",
    "point3": "💫 I WILL live and speak KEPT FROM STUMBLING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry KEPT FROM STUMBLING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Jude 24. Help me walk in kept from stumbling today."
  },
  {
    "date": "2025-10-31",
    "type": "morning",
    "title": "Guarded by Peace",
    "verse_ref": "Philippians 4:6–7",
    "verse_text": "The peace of God will guard your hearts and minds in Christ Jesus.",
    "encouragement_intro": "This reminds me that guarded by peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GUARDED BY PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s GUARDED BY PEACE from my life.",
    "point3": "💫 I WILL live and speak GUARDED BY PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GUARDED BY PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Philippians 4:6–7. Help me walk in guarded by peace today."
  }
]