[
  {
    "date": "2025-10-01",
    "type": "night",
    "verse_ref": "Philippians 4:6–7",
    "verse_text": "The peace of God will guard your hearts and minds in Christ Jesus.",
    "reflection": "The peace of God will guard your hearts and minds in Christ Jesus. This reminds me that guarded by peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal guarded by peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-02",
    "type": "night",
    "verse_ref": "John 16:33",
    "verse_text": "In Me you may have peace… Take heart; I have overcome the world.",
    "reflection": "In Me you may have peace… Take heart; I have overcome the world. This reminds me that peace in trouble is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal peace in trouble in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-03",
    "type": "night",
    "verse_ref": "Colossians 3:15",
    "verse_text": "Let the peace of Christ rule in your hearts.",
    "reflection": "Let the peace of Christ rule in your hearts. This reminds me that peace rules my heart is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal peace rules my heart in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-04",
    "type": "night",
    "verse_ref": "Psalm 46:10",
    "verse_text": "Be still, and know that I am God.",
    "reflection": "Be still, and know that I am God. This reminds me that be still and know is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal be still and know in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-05",
    "type": "night",
    "verse_ref": "Proverbs 3:5–6",
    "verse_text": "Trust in the Lord… He will make your paths straight.",
    "reflection": "Trust in the Lord… He will make your paths straight. This reminds me that trust that steadies is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal trust that steadies in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-06",
    "type": "night",
    "verse_ref": "Isaiah 41:10",
    "verse_text": "Do not fear, for I am with you… I will uphold you.",
    "reflection": "Do not fear, for I am with you… I will uphold you. This reminds me that upheld by god is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal upheld by god in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-07",
    "type": "night",
    "verse_ref": "Psalm 62:5–6",
    "verse_text": "My hope comes from Him… He is my fortress; I will not be shaken.",
    "reflection": "My hope comes from Him… He is my fortress; I will not be shaken. This reminds me that unshakable hope is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal unshakable hope in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-08",
    "type": "night",
    "verse_ref": "2 Thessalonians 3:16",
    "verse_text": "The Lord of peace Himself give you peace at all times and in every way.",
    "reflection": "The Lord of peace Himself give you peace at all times and in every way. This reminds me that peace at all times is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal peace at all times in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-09",
    "type": "night",
    "verse_ref": "Romans 15:13",
    "verse_text": "May the God of hope fill you with all joy and peace as you trust in Him.",
    "reflection": "May the God of hope fill you with all joy and peace as you trust in Him. This reminds me that joy & peace in believing is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal joy & peace in believing in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-10",
    "type": "night",
    "verse_ref": "Psalm 121:1–2",
    "verse_text": "My help comes from the Lord, the Maker of heaven and earth.",
    "reflection": "My help comes from the Lord, the Maker of heaven and earth. This reminds me that help from the lord is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal help from the lord in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-11",
    "type": "night",
    "verse_ref": "Psalm 34:4",
    "verse_text": "I sought the Lord, and He delivered me from all my fears.",
    "reflection": "I sought the Lord, and He delivered me from all my fears. This reminds me that delivered from fear is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal delivered from fear in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-12",
    "type": "night",
    "verse_ref": "Matthew 11:28–29",
    "verse_text": "Come to Me… and you will find rest for your souls.",
    "reflection": "Come to Me… and you will find rest for your souls. This reminds me that rest for your soul is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal rest for your soul in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-13",
    "type": "night",
    "verse_ref": "Psalm 29:11",
    "verse_text": "The Lord gives strength… the Lord blesses His people with peace.",
    "reflection": "The Lord gives strength… the Lord blesses His people with peace. This reminds me that blessed with peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal blessed with peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-14",
    "type": "night",
    "verse_ref": "Ephesians 2:14",
    "verse_text": "He Himself is our peace.",
    "reflection": "He Himself is our peace. This reminds me that christ, our peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal christ, our peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-15",
    "type": "night",
    "verse_ref": "Psalm 91:1–2",
    "verse_text": "Whoever dwells in the shelter of the Most High will rest in the Almighty.",
    "reflection": "Whoever dwells in the shelter of the Most High will rest in the Almighty. This reminds me that dwelling in safety is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal dwelling in safety in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-16",
    "type": "night",
    "verse_ref": "1 Peter 5:7",
    "verse_text": "Cast all your anxiety on Him because He cares for you.",
    "reflection": "Cast all your anxiety on Him because He cares for you. This reminds me that casting anxiety is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal casting anxiety in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-17",
    "type": "night",
    "verse_ref": "Jeremiah 29:11",
    "verse_text": "Plans to prosper you and not to harm you, to give you a future and a hope.",
    "reflection": "Plans to prosper you and not to harm you, to give you a future and a hope. This reminds me that hope & future is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal hope & future in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-18",
    "type": "night",
    "verse_ref": "Psalm 37:5–7",
    "verse_text": "Commit your way to the Lord… be still before Him and wait patiently.",
    "reflection": "Commit your way to the Lord… be still before Him and wait patiently. This reminds me that commit & be still is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal commit & be still in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-19",
    "type": "night",
    "verse_ref": "Hebrews 13:5–6",
    "verse_text": "I will never leave you nor forsake you… The Lord is my helper.",
    "reflection": "I will never leave you nor forsake you… The Lord is my helper. This reminds me that never forsaken is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal never forsaken in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-20",
    "type": "night",
    "verse_ref": "James 1:5",
    "verse_text": "If any of you lacks wisdom, ask God… and it will be given.",
    "reflection": "If any of you lacks wisdom, ask God… and it will be given. This reminds me that wisdom for the path is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal wisdom for the path in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-21",
    "type": "night",
    "verse_ref": "Psalm 1:2–3",
    "verse_text": "Like a tree planted by streams of water… prospers in season.",
    "reflection": "Like a tree planted by streams of water… prospers in season. This reminds me that rooted & fruitful is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal rooted & fruitful in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-22",
    "type": "night",
    "verse_ref": "Isaiah 32:17",
    "verse_text": "The effect of righteousness will be peace… quietness and trust forever.",
    "reflection": "The effect of righteousness will be peace… quietness and trust forever. This reminds me that righteous peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal righteous peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-23",
    "type": "night",
    "verse_ref": "2 Corinthians 9:8",
    "verse_text": "God is able to bless you abundantly… in all things at all times.",
    "reflection": "God is able to bless you abundantly… in all things at all times. This reminds me that grace abounds is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal grace abounds in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-24",
    "type": "night",
    "verse_ref": "Psalm 55:22",
    "verse_text": "Cast your cares on the Lord and He will sustain you.",
    "reflection": "Cast your cares on the Lord and He will sustain you. This reminds me that sustained by god is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal sustained by god in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-25",
    "type": "night",
    "verse_ref": "John 14:1",
    "verse_text": "Do not let your hearts be troubled. Believe in God; believe also in Me.",
    "reflection": "Do not let your hearts be troubled. Believe in God; believe also in Me. This reminds me that troubled heart, trusting heart is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal troubled heart, trusting heart in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-26",
    "type": "night",
    "verse_ref": "Romans 8:28",
    "verse_text": "In all things God works for the good of those who love Him.",
    "reflection": "In all things God works for the good of those who love Him. This reminds me that working for good is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal working for good in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-27",
    "type": "night",
    "verse_ref": "Psalm 20:7",
    "verse_text": "Some trust in chariots… but we trust in the name of the Lord.",
    "reflection": "Some trust in chariots… but we trust in the name of the Lord. This reminds me that trusting his name is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal trusting his name in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-28",
    "type": "night",
    "verse_ref": "Galatians 5:22–23",
    "verse_text": "The fruit of the Spirit is love, joy, peace…",
    "reflection": "The fruit of the Spirit is love, joy, peace… This reminds me that fruit of peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal fruit of peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-29",
    "type": "night",
    "verse_ref": "Colossians 1:11",
    "verse_text": "Strengthened with all power… for great endurance and patience.",
    "reflection": "Strengthened with all power… for great endurance and patience. This reminds me that strength to endure is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal strength to endure in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-10-30",
    "type": "night",
    "verse_ref": "Jude 24",
    "verse_text": "To Him who is able to keep you from stumbling…",
    "reflection": "To Him who is able to keep you from stumbling… This reminds me that kept from stumbling is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal kept from stumbling in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  }
]