[
  {
    "date": "2025-11-01",
    "type": "night",
    "verse_ref": "1 Thessalonians 5:18",
    "verse_text": "Give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
    "reflection": "Give thanks in all circumstances; for this is God’s will for you in Christ Jesus. This reminds me that grateful in all things is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal grateful in all things in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-02",
    "type": "night",
    "verse_ref": "Acts 16:25–26",
    "verse_text": "At midnight Paul and Silas were praying and singing hymns to God… and the prison doors flew open.",
    "reflection": "At midnight Paul and Silas were praying and singing hymns to God… and the prison doors flew open. This reminds me that praise opens doors is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise opens doors in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-03",
    "type": "night",
    "verse_ref": "2 Corinthians 9:7",
    "verse_text": "Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion.",
    "reflection": "Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion. This reminds me that joyful giving is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal joyful giving in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-04",
    "type": "night",
    "verse_ref": "James 1:2–3",
    "verse_text": "Consider it pure joy, my brothers and sisters, whenever you face trials of many kinds.",
    "reflection": "Consider it pure joy, my brothers and sisters, whenever you face trials of many kinds. This reminds me that thankful in trials is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thankful in trials in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-05",
    "type": "night",
    "verse_ref": "Psalm 34:1",
    "verse_text": "I will bless the Lord at all times; His praise will always be on my lips.",
    "reflection": "I will bless the Lord at all times; His praise will always be on my lips. This reminds me that worship through words is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal worship through words in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-06",
    "type": "night",
    "verse_ref": "Colossians 2:6–7",
    "verse_text": "Be rooted and built up in Him… overflowing with thankfulness.",
    "reflection": "Be rooted and built up in Him… overflowing with thankfulness. This reminds me that overflowing gratitude is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal overflowing gratitude in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-07",
    "type": "night",
    "verse_ref": "Psalm 92:1–2",
    "verse_text": "It is good to praise the Lord and make music to Your name, O Most High.",
    "reflection": "It is good to praise the Lord and make music to Your name, O Most High. This reminds me that praise in the morning is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise in the morning in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-08",
    "type": "night",
    "verse_ref": "Psalm 100:1–2",
    "verse_text": "Shout for joy to the Lord, all the earth. Worship the Lord with gladness.",
    "reflection": "Shout for joy to the Lord, all the earth. Worship the Lord with gladness. This reminds me that songs of joy is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal songs of joy in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-09",
    "type": "night",
    "verse_ref": "Psalm 103:1–2",
    "verse_text": "Bless the Lord, O my soul, and forget not all His benefits.",
    "reflection": "Bless the Lord, O my soul, and forget not all His benefits. This reminds me that bless his name is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal bless his name in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-10",
    "type": "night",
    "verse_ref": "Nehemiah 8:10",
    "verse_text": "The joy of the Lord is your strength.",
    "reflection": "The joy of the Lord is your strength. This reminds me that gratitude that strengthens is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal gratitude that strengthens in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-11",
    "type": "night",
    "verse_ref": "Habakkuk 3:17–18",
    "verse_text": "Though the fig tree does not bud… yet I will rejoice in the Lord.",
    "reflection": "Though the fig tree does not bud… yet I will rejoice in the Lord. This reminds me that praise in the valley is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise in the valley in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-12",
    "type": "night",
    "verse_ref": "Psalm 69:30",
    "verse_text": "I will praise God’s name in song and glorify Him with thanksgiving.",
    "reflection": "I will praise God’s name in song and glorify Him with thanksgiving. This reminds me that voice of thanksgiving is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal voice of thanksgiving in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-13",
    "type": "night",
    "verse_ref": "Zechariah 4:10",
    "verse_text": "Do not despise these small beginnings, for the Lord rejoices to see the work begin.",
    "reflection": "Do not despise these small beginnings, for the Lord rejoices to see the work begin. This reminds me that thanks for the little things is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thanks for the little things in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-14",
    "type": "night",
    "verse_ref": "Isaiah 61:3",
    "verse_text": "He gives the oil of joy for mourning, a garment of praise for a spirit of heaviness.",
    "reflection": "He gives the oil of joy for mourning, a garment of praise for a spirit of heaviness. This reminds me that praise transforms is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise transforms in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-15",
    "type": "night",
    "verse_ref": "Psalm 77:11",
    "verse_text": "I will remember the deeds of the Lord; yes, I will remember Your miracles of long ago.",
    "reflection": "I will remember the deeds of the Lord; yes, I will remember Your miracles of long ago. This reminds me that thankful remembrance is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thankful remembrance in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-16",
    "type": "night",
    "verse_ref": "Philippians 4:6–7",
    "verse_text": "With thanksgiving, present your requests to God. And the peace of God will guard your hearts.",
    "reflection": "With thanksgiving, present your requests to God. And the peace of God will guard your hearts. This reminds me that overflowing with peace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal overflowing with peace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-17",
    "type": "night",
    "verse_ref": "Psalm 30:11–12",
    "verse_text": "You turned my mourning into dancing… that my heart may sing Your praises and not be silent.",
    "reflection": "You turned my mourning into dancing… that my heart may sing Your praises and not be silent. This reminds me that praise that lifts is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise that lifts in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-18",
    "type": "night",
    "verse_ref": "Psalm 145:1–2",
    "verse_text": "I will exalt You, my God the King; every day I will praise You and extol Your name forever.",
    "reflection": "I will exalt You, my God the King; every day I will praise You and extol Your name forever. This reminds me that faithful praise is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal faithful praise in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-19",
    "type": "night",
    "verse_ref": "Psalm 136:1",
    "verse_text": "Give thanks to the Lord, for He is good; His love endures forever.",
    "reflection": "Give thanks to the Lord, for He is good; His love endures forever. This reminds me that the power of gratitude is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the power of gratitude in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-20",
    "type": "night",
    "verse_ref": "Ephesians 5:19–20",
    "verse_text": "Sing and make music from your heart to the Lord, always giving thanks to God the Father.",
    "reflection": "Sing and make music from your heart to the Lord, always giving thanks to God the Father. This reminds me that a thankful spirit is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal a thankful spirit in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-21",
    "type": "night",
    "verse_ref": "Revelation 5:13",
    "verse_text": "To Him who sits on the throne and to the Lamb be praise and honor forever.",
    "reflection": "To Him who sits on the throne and to the Lamb be praise and honor forever. This reminds me that praise unending is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise unending in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-22",
    "type": "night",
    "verse_ref": "1 Corinthians 1:4",
    "verse_text": "I always thank my God for you because of His grace given you in Christ Jesus.",
    "reflection": "I always thank my God for you because of His grace given you in Christ Jesus. This reminds me that thankful for grace is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thankful for grace in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-23",
    "type": "night",
    "verse_ref": "Psalm 42:11",
    "verse_text": "Why, my soul, are you downcast? Put your hope in God, for I will yet praise Him.",
    "reflection": "Why, my soul, are you downcast? Put your hope in God, for I will yet praise Him. This reminds me that praise through pain is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal praise through pain in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-24",
    "type": "night",
    "verse_ref": "Lamentations 3:22–23",
    "verse_text": "His mercies never come to an end; they are new every morning.",
    "reflection": "His mercies never come to an end; they are new every morning. This reminds me that grateful for his mercy is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal grateful for his mercy in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-25",
    "type": "night",
    "verse_ref": "2 Corinthians 4:15",
    "verse_text": "Grace reaches more and more people, causing thanksgiving to overflow to the glory of God.",
    "reflection": "Grace reaches more and more people, causing thanksgiving to overflow to the glory of God. This reminds me that thanksgiving overflow is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thanksgiving overflow in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-26",
    "type": "night",
    "verse_ref": "Psalm 96:1–2",
    "verse_text": "Sing to the Lord a new song; proclaim His salvation day after day.",
    "reflection": "Sing to the Lord a new song; proclaim His salvation day after day. This reminds me that sing to the lord is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal sing to the lord in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-27",
    "type": "night",
    "verse_ref": "Psalm 9:1",
    "verse_text": "I will give thanks to You, Lord, with all my heart; I will tell of all Your wonderful deeds.",
    "reflection": "I will give thanks to You, Lord, with all my heart; I will tell of all Your wonderful deeds. This reminds me that hearts of gratitude is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal hearts of gratitude in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-28",
    "type": "night",
    "verse_ref": "Jonah 2:9",
    "verse_text": "With shouts of grateful praise, I will sacrifice to You. Salvation comes from the Lord.",
    "reflection": "With shouts of grateful praise, I will sacrifice to You. Salvation comes from the Lord. This reminds me that thankful for salvation is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal thankful for salvation in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-29",
    "type": "night",
    "verse_ref": "Psalm 95:6",
    "verse_text": "Come, let us bow down in worship, let us kneel before the Lord our Maker.",
    "reflection": "Come, let us bow down in worship, let us kneel before the Lord our Maker. This reminds me that worship and wonder is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal worship and wonder in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-11-30",
    "type": "night",
    "verse_ref": "Psalm 106:1",
    "verse_text": "Give thanks to the Lord, for He is good; His love endures forever.",
    "reflection": "Give thanks to the Lord, for He is good; His love endures forever. This reminds me that eternal thanksgiving is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal eternal thanksgiving in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  }
]