[
  {
    "date": "2025-11-01",
    "type": "morning",
    "title": "Grateful in All Things",
    "verse_ref": "1 Thessalonians 5:18",
    "verse_text": "Give thanks in all circumstances; for this is God’s will for you in Christ Jesus.",
    "encouragement_intro": "This reminds me that grateful in all things is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GRATEFUL IN ALL THINGS.",
    "point2": "💫 I REFUSE to let anything steal God’s GRATEFUL IN ALL THINGS from my life.",
    "point3": "💫 I WILL live and speak GRATEFUL IN ALL THINGS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GRATEFUL IN ALL THINGS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 1 Thessalonians 5:18. Help me walk in grateful in all things today."
  },
  {
    "date": "2025-11-02",
    "type": "morning",
    "title": "Praise Opens Doors",
    "verse_ref": "Acts 16:25–26",
    "verse_text": "At midnight Paul and Silas were praying and singing hymns to God… and the prison doors flew open.",
    "encouragement_intro": "This reminds me that praise opens doors is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE OPENS DOORS.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE OPENS DOORS from my life.",
    "point3": "💫 I WILL live and speak PRAISE OPENS DOORS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE OPENS DOORS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Acts 16:25–26. Help me walk in praise opens doors today."
  },
  {
    "date": "2025-11-03",
    "type": "morning",
    "title": "Joyful Giving",
    "verse_ref": "2 Corinthians 9:7",
    "verse_text": "Each of you should give what you have decided in your heart to give, not reluctantly or under compulsion.",
    "encouragement_intro": "This reminds me that joyful giving is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in JOYFUL GIVING.",
    "point2": "💫 I REFUSE to let anything steal God’s JOYFUL GIVING from my life.",
    "point3": "💫 I WILL live and speak JOYFUL GIVING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry JOYFUL GIVING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Corinthians 9:7. Help me walk in joyful giving today."
  },
  {
    "date": "2025-11-04",
    "type": "morning",
    "title": "Thankful in Trials",
    "verse_ref": "James 1:2–3",
    "verse_text": "Consider it pure joy, my brothers and sisters, whenever you face trials of many kinds.",
    "encouragement_intro": "This reminds me that thankful in trials is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKFUL IN TRIALS.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKFUL IN TRIALS from my life.",
    "point3": "💫 I WILL live and speak THANKFUL IN TRIALS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKFUL IN TRIALS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in James 1:2–3. Help me walk in thankful in trials today."
  },
  {
    "date": "2025-11-05",
    "type": "morning",
    "title": "Worship through Words",
    "verse_ref": "Psalm 34:1",
    "verse_text": "I will bless the Lord at all times; His praise will always be on my lips.",
    "encouragement_intro": "This reminds me that worship through words is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in WORSHIP THROUGH WORDS.",
    "point2": "💫 I REFUSE to let anything steal God’s WORSHIP THROUGH WORDS from my life.",
    "point3": "💫 I WILL live and speak WORSHIP THROUGH WORDS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry WORSHIP THROUGH WORDS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 34:1. Help me walk in worship through words today."
  },
  {
    "date": "2025-11-06",
    "type": "morning",
    "title": "Overflowing Gratitude",
    "verse_ref": "Colossians 2:6–7",
    "verse_text": "Be rooted and built up in Him… overflowing with thankfulness.",
    "encouragement_intro": "This reminds me that overflowing gratitude is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in OVERFLOWING GRATITUDE.",
    "point2": "💫 I REFUSE to let anything steal God’s OVERFLOWING GRATITUDE from my life.",
    "point3": "💫 I WILL live and speak OVERFLOWING GRATITUDE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry OVERFLOWING GRATITUDE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Colossians 2:6–7. Help me walk in overflowing gratitude today."
  },
  {
    "date": "2025-11-07",
    "type": "morning",
    "title": "Praise in the Morning",
    "verse_ref": "Psalm 92:1–2",
    "verse_text": "It is good to praise the Lord and make music to Your name, O Most High.",
    "encouragement_intro": "This reminds me that praise in the morning is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE IN THE MORNING.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE IN THE MORNING from my life.",
    "point3": "💫 I WILL live and speak PRAISE IN THE MORNING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE IN THE MORNING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 92:1–2. Help me walk in praise in the morning today."
  },
  {
    "date": "2025-11-08",
    "type": "morning",
    "title": "Songs of Joy",
    "verse_ref": "Psalm 100:1–2",
    "verse_text": "Shout for joy to the Lord, all the earth. Worship the Lord with gladness.",
    "encouragement_intro": "This reminds me that songs of joy is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in SONGS OF JOY.",
    "point2": "💫 I REFUSE to let anything steal God’s SONGS OF JOY from my life.",
    "point3": "💫 I WILL live and speak SONGS OF JOY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry SONGS OF JOY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 100:1–2. Help me walk in songs of joy today."
  },
  {
    "date": "2025-11-09",
    "type": "morning",
    "title": "Bless His Name",
    "verse_ref": "Psalm 103:1–2",
    "verse_text": "Bless the Lord, O my soul, and forget not all His benefits.",
    "encouragement_intro": "This reminds me that bless his name is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in BLESS HIS NAME.",
    "point2": "💫 I REFUSE to let anything steal God’s BLESS HIS NAME from my life.",
    "point3": "💫 I WILL live and speak BLESS HIS NAME boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry BLESS HIS NAME with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 103:1–2. Help me walk in bless his name today."
  },
  {
    "date": "2025-11-10",
    "type": "morning",
    "title": "Gratitude That Strengthens",
    "verse_ref": "Nehemiah 8:10",
    "verse_text": "The joy of the Lord is your strength.",
    "encouragement_intro": "This reminds me that gratitude that strengthens is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GRATITUDE THAT STRENGTHENS.",
    "point2": "💫 I REFUSE to let anything steal God’s GRATITUDE THAT STRENGTHENS from my life.",
    "point3": "💫 I WILL live and speak GRATITUDE THAT STRENGTHENS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GRATITUDE THAT STRENGTHENS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Nehemiah 8:10. Help me walk in gratitude that strengthens today."
  },
  {
    "date": "2025-11-11",
    "type": "morning",
    "title": "Praise in the Valley",
    "verse_ref": "Habakkuk 3:17–18",
    "verse_text": "Though the fig tree does not bud… yet I will rejoice in the Lord.",
    "encouragement_intro": "This reminds me that praise in the valley is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE IN THE VALLEY.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE IN THE VALLEY from my life.",
    "point3": "💫 I WILL live and speak PRAISE IN THE VALLEY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE IN THE VALLEY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Habakkuk 3:17–18. Help me walk in praise in the valley today."
  },
  {
    "date": "2025-11-12",
    "type": "morning",
    "title": "Voice of Thanksgiving",
    "verse_ref": "Psalm 69:30",
    "verse_text": "I will praise God’s name in song and glorify Him with thanksgiving.",
    "encouragement_intro": "This reminds me that voice of thanksgiving is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in VOICE OF THANKSGIVING.",
    "point2": "💫 I REFUSE to let anything steal God’s VOICE OF THANKSGIVING from my life.",
    "point3": "💫 I WILL live and speak VOICE OF THANKSGIVING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry VOICE OF THANKSGIVING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 69:30. Help me walk in voice of thanksgiving today."
  },
  {
    "date": "2025-11-13",
    "type": "morning",
    "title": "Thanks for the Little Things",
    "verse_ref": "Zechariah 4:10",
    "verse_text": "Do not despise these small beginnings, for the Lord rejoices to see the work begin.",
    "encouragement_intro": "This reminds me that thanks for the little things is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKS FOR THE LITTLE THINGS.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKS FOR THE LITTLE THINGS from my life.",
    "point3": "💫 I WILL live and speak THANKS FOR THE LITTLE THINGS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKS FOR THE LITTLE THINGS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Zechariah 4:10. Help me walk in thanks for the little things today."
  },
  {
    "date": "2025-11-14",
    "type": "morning",
    "title": "Praise Transforms",
    "verse_ref": "Isaiah 61:3",
    "verse_text": "He gives the oil of joy for mourning, a garment of praise for a spirit of heaviness.",
    "encouragement_intro": "This reminds me that praise transforms is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE TRANSFORMS.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE TRANSFORMS from my life.",
    "point3": "💫 I WILL live and speak PRAISE TRANSFORMS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE TRANSFORMS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Isaiah 61:3. Help me walk in praise transforms today."
  },
  {
    "date": "2025-11-15",
    "type": "morning",
    "title": "Thankful Remembrance",
    "verse_ref": "Psalm 77:11",
    "verse_text": "I will remember the deeds of the Lord; yes, I will remember Your miracles of long ago.",
    "encouragement_intro": "This reminds me that thankful remembrance is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKFUL REMEMBRANCE.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKFUL REMEMBRANCE from my life.",
    "point3": "💫 I WILL live and speak THANKFUL REMEMBRANCE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKFUL REMEMBRANCE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 77:11. Help me walk in thankful remembrance today."
  },
  {
    "date": "2025-11-16",
    "type": "morning",
    "title": "Overflowing with Peace",
    "verse_ref": "Philippians 4:6–7",
    "verse_text": "With thanksgiving, present your requests to God. And the peace of God will guard your hearts.",
    "encouragement_intro": "This reminds me that overflowing with peace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in OVERFLOWING WITH PEACE.",
    "point2": "💫 I REFUSE to let anything steal God’s OVERFLOWING WITH PEACE from my life.",
    "point3": "💫 I WILL live and speak OVERFLOWING WITH PEACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry OVERFLOWING WITH PEACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Philippians 4:6–7. Help me walk in overflowing with peace today."
  },
  {
    "date": "2025-11-17",
    "type": "morning",
    "title": "Praise That Lifts",
    "verse_ref": "Psalm 30:11–12",
    "verse_text": "You turned my mourning into dancing… that my heart may sing Your praises and not be silent.",
    "encouragement_intro": "This reminds me that praise that lifts is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE THAT LIFTS.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE THAT LIFTS from my life.",
    "point3": "💫 I WILL live and speak PRAISE THAT LIFTS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE THAT LIFTS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 30:11–12. Help me walk in praise that lifts today."
  },
  {
    "date": "2025-11-18",
    "type": "morning",
    "title": "Faithful Praise",
    "verse_ref": "Psalm 145:1–2",
    "verse_text": "I will exalt You, my God the King; every day I will praise You and extol Your name forever.",
    "encouragement_intro": "This reminds me that faithful praise is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in FAITHFUL PRAISE.",
    "point2": "💫 I REFUSE to let anything steal God’s FAITHFUL PRAISE from my life.",
    "point3": "💫 I WILL live and speak FAITHFUL PRAISE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry FAITHFUL PRAISE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 145:1–2. Help me walk in faithful praise today."
  },
  {
    "date": "2025-11-19",
    "type": "morning",
    "title": "The Power of Gratitude",
    "verse_ref": "Psalm 136:1",
    "verse_text": "Give thanks to the Lord, for He is good; His love endures forever.",
    "encouragement_intro": "This reminds me that the power of gratitude is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE POWER OF GRATITUDE.",
    "point2": "💫 I REFUSE to let anything steal God’s THE POWER OF GRATITUDE from my life.",
    "point3": "💫 I WILL live and speak THE POWER OF GRATITUDE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE POWER OF GRATITUDE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 136:1. Help me walk in the power of gratitude today."
  },
  {
    "date": "2025-11-20",
    "type": "morning",
    "title": "A Thankful Spirit",
    "verse_ref": "Ephesians 5:19–20",
    "verse_text": "Sing and make music from your heart to the Lord, always giving thanks to God the Father.",
    "encouragement_intro": "This reminds me that a thankful spirit is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in A THANKFUL SPIRIT.",
    "point2": "💫 I REFUSE to let anything steal God’s A THANKFUL SPIRIT from my life.",
    "point3": "💫 I WILL live and speak A THANKFUL SPIRIT boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry A THANKFUL SPIRIT with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Ephesians 5:19–20. Help me walk in a thankful spirit today."
  },
  {
    "date": "2025-11-21",
    "type": "morning",
    "title": "Praise Unending",
    "verse_ref": "Revelation 5:13",
    "verse_text": "To Him who sits on the throne and to the Lamb be praise and honor forever.",
    "encouragement_intro": "This reminds me that praise unending is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE UNENDING.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE UNENDING from my life.",
    "point3": "💫 I WILL live and speak PRAISE UNENDING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE UNENDING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Revelation 5:13. Help me walk in praise unending today."
  },
  {
    "date": "2025-11-22",
    "type": "morning",
    "title": "Thankful for Grace",
    "verse_ref": "1 Corinthians 1:4",
    "verse_text": "I always thank my God for you because of His grace given you in Christ Jesus.",
    "encouragement_intro": "This reminds me that thankful for grace is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKFUL FOR GRACE.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKFUL FOR GRACE from my life.",
    "point3": "💫 I WILL live and speak THANKFUL FOR GRACE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKFUL FOR GRACE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 1 Corinthians 1:4. Help me walk in thankful for grace today."
  },
  {
    "date": "2025-11-23",
    "type": "morning",
    "title": "Praise Through Pain",
    "verse_ref": "Psalm 42:11",
    "verse_text": "Why, my soul, are you downcast? Put your hope in God, for I will yet praise Him.",
    "encouragement_intro": "This reminds me that praise through pain is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PRAISE THROUGH PAIN.",
    "point2": "💫 I REFUSE to let anything steal God’s PRAISE THROUGH PAIN from my life.",
    "point3": "💫 I WILL live and speak PRAISE THROUGH PAIN boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PRAISE THROUGH PAIN with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 42:11. Help me walk in praise through pain today."
  },
  {
    "date": "2025-11-24",
    "type": "morning",
    "title": "Grateful for His Mercy",
    "verse_ref": "Lamentations 3:22–23",
    "verse_text": "His mercies never come to an end; they are new every morning.",
    "encouragement_intro": "This reminds me that grateful for his mercy is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GRATEFUL FOR HIS MERCY.",
    "point2": "💫 I REFUSE to let anything steal God’s GRATEFUL FOR HIS MERCY from my life.",
    "point3": "💫 I WILL live and speak GRATEFUL FOR HIS MERCY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GRATEFUL FOR HIS MERCY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Lamentations 3:22–23. Help me walk in grateful for his mercy today."
  },
  {
    "date": "2025-11-25",
    "type": "morning",
    "title": "Thanksgiving Overflow",
    "verse_ref": "2 Corinthians 4:15",
    "verse_text": "Grace reaches more and more people, causing thanksgiving to overflow to the glory of God.",
    "encouragement_intro": "This reminds me that thanksgiving overflow is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKSGIVING OVERFLOW.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKSGIVING OVERFLOW from my life.",
    "point3": "💫 I WILL live and speak THANKSGIVING OVERFLOW boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKSGIVING OVERFLOW with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Corinthians 4:15. Help me walk in thanksgiving overflow today."
  },
  {
    "date": "2025-11-26",
    "type": "morning",
    "title": "Sing to the Lord",
    "verse_ref": "Psalm 96:1–2",
    "verse_text": "Sing to the Lord a new song; proclaim His salvation day after day.",
    "encouragement_intro": "This reminds me that sing to the lord is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in SING TO THE LORD.",
    "point2": "💫 I REFUSE to let anything steal God’s SING TO THE LORD from my life.",
    "point3": "💫 I WILL live and speak SING TO THE LORD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry SING TO THE LORD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 96:1–2. Help me walk in sing to the lord today."
  },
  {
    "date": "2025-11-27",
    "type": "morning",
    "title": "Hearts of Gratitude",
    "verse_ref": "Psalm 9:1",
    "verse_text": "I will give thanks to You, Lord, with all my heart; I will tell of all Your wonderful deeds.",
    "encouragement_intro": "This reminds me that hearts of gratitude is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HEARTS OF GRATITUDE.",
    "point2": "💫 I REFUSE to let anything steal God’s HEARTS OF GRATITUDE from my life.",
    "point3": "💫 I WILL live and speak HEARTS OF GRATITUDE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HEARTS OF GRATITUDE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 9:1. Help me walk in hearts of gratitude today."
  },
  {
    "date": "2025-11-28",
    "type": "morning",
    "title": "Thankful for Salvation",
    "verse_ref": "Jonah 2:9",
    "verse_text": "With shouts of grateful praise, I will sacrifice to You. Salvation comes from the Lord.",
    "encouragement_intro": "This reminds me that thankful for salvation is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THANKFUL FOR SALVATION.",
    "point2": "💫 I REFUSE to let anything steal God’s THANKFUL FOR SALVATION from my life.",
    "point3": "💫 I WILL live and speak THANKFUL FOR SALVATION boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THANKFUL FOR SALVATION with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Jonah 2:9. Help me walk in thankful for salvation today."
  },
  {
    "date": "2025-11-29",
    "type": "morning",
    "title": "Worship and Wonder",
    "verse_ref": "Psalm 95:6",
    "verse_text": "Come, let us bow down in worship, let us kneel before the Lord our Maker.",
    "encouragement_intro": "This reminds me that worship and wonder is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in WORSHIP AND WONDER.",
    "point2": "💫 I REFUSE to let anything steal God’s WORSHIP AND WONDER from my life.",
    "point3": "💫 I WILL live and speak WORSHIP AND WONDER boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry WORSHIP AND WONDER with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 95:6. Help me walk in worship and wonder today."
  },
  {
    "date": "2025-11-30",
    "type": "morning",
    "title": "Eternal Thanksgiving",
    "verse_ref": "Psalm 106:1",
    "verse_text": "Give thanks to the Lord, for He is good; His love endures forever.",
    "encouragement_intro": "This reminds me that eternal thanksgiving is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in ETERNAL THANKSGIVING.",
    "point2": "💫 I REFUSE to let anything steal God’s ETERNAL THANKSGIVING from my life.",
    "point3": "💫 I WILL live and speak ETERNAL THANKSGIVING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry ETERNAL THANKSGIVING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 106:1. Help me walk in eternal thanksgiving today."
  }
]