[
  {
    "date": "2026-01-01",
    "theme": "Silent Strength",
    "morning": {
      "title": "He Goes Before You",
      "verse_ref": "Deuteronomy 31:8",
      "verse_text": "The LORD Himself goes before you and will be with you.",
      "heart_picture": "Like a leader walking ahead on a dark road with a lamp in His hand.",
      "silent_soul_meaning": "You are not stepping into this year alone; God already walked it before you woke up.",
      "prayer": "Lord, go before me today and make me brave to follow."
    },
    "night": {
      "title": "Rest in His Peace",
      "verse_ref": "Psalm 4:8",
      "verse_text": "In peace I will lie down and sleep.",
      "heart_picture": "Like a child sleeping safely while a watchman guards the door.",
      "silent_soul_meaning": "Even if your mind is noisy, God’s peace stands guard while you sleep.",
      "prayer": "Lord, quiet my thoughts and give me deep rest tonight."
    }
  },
  {
    "date": "2026-01-02",
    "theme": "Silent Strength",
    "morning": {
      "title": "Strength for the Weak",
      "verse_ref": "Isaiah 40:29",
      "verse_text": "He gives strength to the weary and increases the power of the weak.",
      "heart_picture": "Like fresh wind filling the sails of a boat that could not move.",
      "silent_soul_meaning": "When your body and heart feel tired, God becomes the push that keeps you going.",
      "prayer": "Lord, breathe Your strength into my weak places today."
    },
    "night": {
      "title": "Come When You Are Tired",
      "verse_ref": "Matthew 11:28",
      "verse_text": "Come to Me, all you who are weary and burdened, and I will give you rest.",
      "heart_picture": "Like dropping a heavy suitcase after a long walk and sitting in a safe place.",
      "silent_soul_meaning": "You do not have to pretend to be strong; you can come to Jesus exactly as you are.",
      "prayer": "Jesus, I bring You my tired body and heavy heart; give me Your rest."
    }
  },
  {
    "date": "2026-01-03",
    "theme": "Silent Strength",
    "morning": {
      "title": "God in the Crisis",
      "verse_ref": "Psalm 46:1",
      "verse_text": "God is our refuge and strength, an ever-present help in trouble.",
      "heart_picture": "Like a strong house that does not shake when the storm hits.",
      "silent_soul_meaning": "You may feel shaken, but you are not homeless; God is your safe place.",
      "prayer": "Lord, be my hiding place and my strength when trouble shows up today."
    },
    "night": {
      "title": "Bring Your Anxiety",
      "verse_ref": "Philippians 4:6",
      "verse_text": "Do not be anxious about anything, but in every situation, by prayer and petition, present your requests to God.",
      "heart_picture": "Like taking tangled wires and slowly placing them into gentle hands.",
      "silent_soul_meaning": "You don’t have to fix everything before bed; you can hand the mess to God.",
      "prayer": "Lord, I give You my worries one by one; hold them while I sleep."
    }
  },
  {
    "date": "2026-01-04",
    "theme": "Silent Strength",
    "morning": {
      "title": "Be Strong and Courageous",
      "verse_ref": "Joshua 1:9",
      "verse_text": "Be strong and courageous... for the LORD your God will be with you wherever you go.",
      "heart_picture": "Like a soldier who walks forward knowing the Commander stands right beside him.",
      "silent_soul_meaning": "Courage is not the absence of fear; it is moving forward with God at your side.",
      "prayer": "Lord, help me face today’s tasks with courage, not retreat."
    },
    "night": {
      "title": "Nothing Wasted",
      "verse_ref": "Romans 8:28",
      "verse_text": "In all things God works for the good of those who love Him.",
      "heart_picture": "Like a potter using broken pieces of clay to shape a new vessel.",
      "silent_soul_meaning": "Even the painful parts of your story can become part of God’s good plan.",
      "prayer": "Lord, I don’t see all the answers, but I trust You to work this for good."
    }
  },
  {
    "date": "2026-01-05",
    "theme": "Silent Strength",
    "morning": {
      "title": "The Lord Is My Shepherd",
      "verse_ref": "Psalm 23:1",
      "verse_text": "The LORD is my shepherd, I lack nothing.",
      "heart_picture": "Like sheep walking behind a gentle shepherd who knows every path.",
      "silent_soul_meaning": "You are not leading yourself; God knows what you need before you ask.",
      "prayer": "Lord, shepherd me today; provide what I truly need, not just what I want."
    },
    "night": {
      "title": "Power in Weakness",
      "verse_ref": "2 Corinthians 12:9",
      "verse_text": "My grace is sufficient for you, for My power is made perfect in weakness.",
      "heart_picture": "Like light shining stronger in a cracked clay pot than in a closed jar.",
      "silent_soul_meaning": "Your weakness is not the end of your story; it is the place where God’s power shows.",
      "prayer": "Lord, I offer You my weakness; let Your strength shine through it."
    }
  },
  {
    "date": "2026-01-06",
    "theme": "Silent Strength",
    "morning": {
      "title": "Peace in the Storm",
      "verse_ref": "John 14:27",
      "verse_text": "My peace I give you... Do not let your hearts be troubled and do not be afraid.",
      "heart_picture": "Like a calm space inside the house while heavy rain beats on the roof.",
      "silent_soul_meaning": "The storm outside cannot cancel the peace Jesus puts inside your heart.",
      "prayer": "Jesus, speak Your peace over my fears today."
    },
    "night": {
      "title": "Cast Your Cares",
      "verse_ref": "1 Peter 5:7",
      "verse_text": "Cast all your anxiety on Him because He cares for you.",
      "heart_picture": "Like taking stones out of your backpack and dropping them into a river.",
      "silent_soul_meaning": "You were not designed to carry every burden; God invites you to hand them over.",
      "prayer": "Lord, I place my worries in Your hands; hold what I cannot carry."
    }
  },
  {
    "date": "2026-01-07",
    "theme": "Silent Strength",
    "morning": {
      "title": "The Lord Is My Light",
      "verse_ref": "Psalm 27:1",
      "verse_text": "The LORD is my light and my salvation; whom shall I fear?",
      "heart_picture": "Like a bright torch suddenly switching on in a dark cave.",
      "silent_soul_meaning": "Fear shrinks when God’s light shines on the truth of who He is.",
      "prayer": "Lord, shine Your light on my fears and chase them away."
    },
    "night": {
      "title": "Come Boldly",
      "verse_ref": "Hebrews 4:16",
      "verse_text": "Let us then approach God’s throne of grace with confidence.",
      "heart_picture": "Like a child who runs into their parent’s room without knocking.",
      "silent_soul_meaning": "Even after a hard day, you are welcome in God’s presence without shame.",
      "prayer": "Lord, I come to You tonight just as I am; meet me with mercy."
    }
  },
  {
    "date": "2026-01-08",
    "theme": "Silent Strength",
    "morning": {
      "title": "Do Not Fear",
      "verse_ref": "Isaiah 41:10",
      "verse_text": "Do not fear, for I am with you... I will strengthen you and help you.",
      "heart_picture": "Like a strong hand holding yours when your knees feel weak.",
      "silent_soul_meaning": "Fear will shout, but God holds you steady and does not let go.",
      "prayer": "Lord, when fear rises, remind me that You are holding me."
    },
    "night": {
      "title": "Ask for Wisdom",
      "verse_ref": "James 1:5",
      "verse_text": "If any of you lacks wisdom, you should ask God... and it will be given to you.",
      "heart_picture": "Like a lamp being handed to you when you stand at a crossroads.",
      "silent_soul_meaning": "You don’t have to guess your way through life; God gives wisdom when you ask.",
      "prayer": "Lord, give me clear wisdom for the choices in front of me."
    }
  },
  {
    "date": "2026-01-09",
    "theme": "Silent Strength",
    "morning": {
      "title": "Close to the Broken",
      "verse_ref": "Psalm 34:18",
      "verse_text": "The LORD is close to the brokenhearted.",
      "heart_picture": "Like someone sitting quietly beside you when words are too heavy.",
      "silent_soul_meaning": "Your tears do not push God away; they draw Him nearer to you.",
      "prayer": "Lord, sit close to me and to those I love who are hurting today."
    },
    "night": {
      "title": "Renew Your Mind",
      "verse_ref": "Romans 12:2",
      "verse_text": "Be transformed by the renewing of your mind.",
      "heart_picture": "Like wiping a dirty window so light can shine in again.",
      "silent_soul_meaning": "God can change how you think so you can live differently, not stuck in old patterns.",
      "prayer": "Lord, clean my thoughts and help me see things the way You do."
    }
  },
  {
    "date": "2026-01-10",
    "theme": "Silent Strength",
    "morning": {
      "title": "Trust and Lean",
      "verse_ref": "Proverbs 3:5-6",
      "verse_text": "Trust in the LORD with all your heart... He will make your paths straight.",
      "heart_picture": "Like leaning your full weight on a strong wall that will not fall.",
      "silent_soul_meaning": "You do not have to understand everything; you can lean fully on God.",
      "prayer": "Lord, I choose to trust You with what I cannot see clearly."
    },
    "night": {
      "title": "Let Peace Rule",
      "verse_ref": "Colossians 3:15",
      "verse_text": "Let the peace of Christ rule in your hearts.",
      "heart_picture": "Like a gentle referee blowing the whistle when chaos tries to take over.",
      "silent_soul_meaning": "God’s peace can say yes or no inside you when confusion comes.",
      "prayer": "Jesus, let Your peace be the ruler in my heart tonight."
    }
  },
  {
    "date": "2026-01-11",
    "theme": "Silent Strength",
    "morning": {
      "title": "Help Comes from the Lord",
      "verse_ref": "Psalm 121:1-2",
      "verse_text": "My help comes from the LORD, the Maker of heaven and earth.",
      "heart_picture": "Like lifting your eyes from the ground to see a strong mountain ahead.",
      "silent_soul_meaning": "Your help does not end with human limits; it begins with God’s power.",
      "prayer": "Lord, I look up to You today; be my help in every need."
    },
    "night": {
      "title": "Give Thanks in Everything",
      "verse_ref": "1 Thessalonians 5:18",
      "verse_text": "Give thanks in all circumstances.",
      "heart_picture": "Like lighting a small candle in a dark room, not to deny the dark but to push it back.",
      "silent_soul_meaning": "Thankfulness does not ignore pain; it remembers that God is still present.",
      "prayer": "Lord, show me one thing to thank You for, even in hard days."
    }
  },
  {
    "date": "2026-01-12",
    "theme": "Silent Strength",
    "morning": {
      "title": "Abide in the Vine",
      "verse_ref": "John 15:5",
      "verse_text": "I am the vine; you are the branches... apart from Me you can do nothing.",
      "heart_picture": "Like a branch staying connected to the tree so the life can flow.",
      "silent_soul_meaning": "You don’t have to force fruit; you just have to stay connected to Jesus.",
      "prayer": "Jesus, keep my heart close to You in every task today."
    },
    "night": {
      "title": "Do Not Give Up",
      "verse_ref": "Galatians 6:9",
      "verse_text": "Let us not become weary in doing good.",
      "heart_picture": "Like a farmer who keeps watering even before he sees any green.",
      "silent_soul_meaning": "You may feel nothing is changing, but God is working under the surface.",
      "prayer": "Lord, give me strength to keep doing good even when results are slow."
    }
  },
  {
    "date": "2026-01-13",
    "theme": "Silent Strength",
    "morning": {
      "title": "Create in Me a Clean Heart",
      "verse_ref": "Psalm 51:10",
      "verse_text": "Create in me a pure heart, O God.",
      "heart_picture": "Like washing dirty clothes and hanging them in the fresh air.",
      "silent_soul_meaning": "You cannot fix your own heart, but God can wash and renew it from the inside.",
      "prayer": "Lord, clean my motives and my desires today."
    },
    "night": {
      "title": "Confess and Be Cleansed",
      "verse_ref": "1 John 1:9",
      "verse_text": "If we confess our sins, He is faithful and just and will forgive us.",
      "heart_picture": "Like opening a window to let smoke out so you can breathe again.",
      "silent_soul_meaning": "Honest confession is the doorway to real freedom and fresh air for your soul.",
      "prayer": "Lord, I confess my sins to You; wash me and make me new."
    }
  },
  {
    "date": "2026-01-14",
    "theme": "Silent Strength",
    "morning": {
      "title": "A New Heart",
      "verse_ref": "Ezekiel 36:26",
      "verse_text": "I will give you a new heart and put a new spirit in you.",
      "heart_picture": "Like replacing a stone with a beating heart that can feel again.",
      "silent_soul_meaning": "God can soften what life has made hard inside you.",
      "prayer": "Lord, remove the hardness in me and make my heart tender to You."
    },
    "night": {
      "title": "Made New in Christ",
      "verse_ref": "2 Corinthians 5:17",
      "verse_text": "If anyone is in Christ, the new creation has come.",
      "heart_picture": "Like an old house being fully rebuilt, not just painted.",
      "silent_soul_meaning": "In Christ you are not just patched up; you are being made truly new.",
      "prayer": "Jesus, help me live like the new person You say I am."
    }
  },
  {
    "date": "2026-01-15",
    "theme": "Silent Strength",
    "morning": {
      "title": "Seek First His Kingdom",
      "verse_ref": "Matthew 6:33",
      "verse_text": "Seek first His kingdom and His righteousness.",
      "heart_picture": "Like setting the correct time on a clock so every alarm rings right.",
      "silent_soul_meaning": "When God is first, the other parts of your life can find their right place.",
      "prayer": "Lord, help me to put You first in my plans and priorities today."
    },
    "night": {
      "title": "God Will Supply",
      "verse_ref": "Philippians 4:19",
      "verse_text": "My God will meet all your needs according to the riches of His glory.",
      "heart_picture": "Like a deep well that never runs dry even in drought.",
      "silent_soul_meaning": "Your bank account has limits; God’s supply for your true needs does not.",
      "prayer": "Lord, I trust You to provide what is needed for tomorrow."
    }
  },
  {
    "date": "2026-01-16",
    "theme": "Silent Strength",
    "morning": {
      "title": "He Will Instruct You",
      "verse_ref": "Psalm 32:8",
      "verse_text": "I will instruct you and teach you in the way you should go.",
      "heart_picture": "Like a guide pointing out the safe path on a dangerous mountain.",
      "silent_soul_meaning": "You are not guessing in the dark; God is willing to guide you step by step.",
      "prayer": "Lord, teach me today and show me the next right step."
    },
    "night": {
      "title": "Perfect Peace",
      "verse_ref": "Isaiah 26:3",
      "verse_text": "You will keep in perfect peace those whose minds are steadfast, because they trust in You.",
      "heart_picture": "Like calm water that does not shake even when the wind blows.",
      "silent_soul_meaning": "Peace grows when your mind keeps returning to trust, not to fear.",
      "prayer": "Lord, fix my thoughts on You and guard my mind with Your peace."
    }
  },
  {
    "date": "2026-01-17",
    "theme": "Silent Strength",
    "morning": {
      "title": "Walk Humbly",
      "verse_ref": "Micah 6:8",
      "verse_text": "What does the LORD require of you? To act justly, love mercy and walk humbly with your God.",
      "heart_picture": "Like walking step by step beside a friend, not running ahead or lagging behind.",
      "silent_soul_meaning": "God calls you to live real, fair, kind, and humble, not perfect and fake.",
      "prayer": "Lord, help me to walk humbly and act with justice and mercy today."
    },
    "night": {
      "title": "Overcome Evil with Good",
      "verse_ref": "Romans 12:21",
      "verse_text": "Do not be overcome by evil, but overcome evil with good.",
      "heart_picture": "Like turning on a light instead of shouting at the darkness.",
      "silent_soul_meaning": "God invites you to answer wrong with His kind of goodness, not revenge.",
      "prayer": "Lord, show me how to answer hurt and evil with Your goodness."
    }
  },
  {
    "date": "2026-01-18",
    "theme": "Silent Strength",
    "morning": {
      "title": "Delight in the Lord",
      "verse_ref": "Psalm 37:4",
      "verse_text": "Take delight in the LORD, and He will give you the desires of your heart.",
      "heart_picture": "Like tuning an instrument so it can play the right song.",
      "silent_soul_meaning": "As you enjoy God, He shapes your desires to match His heart and then fills them.",
      "prayer": "Lord, make my desires match Yours and bring them to life in Your way."
    },
    "night": {
      "title": "I Believe, Help My Unbelief",
      "verse_ref": "Mark 9:24",
      "verse_text": "I do believe; help me overcome my unbelief!",
      "heart_picture": "Like a hand reaching out while still shaking in fear.",
      "silent_soul_meaning": "God can handle your mixed feelings; honest faith includes honest doubt.",
      "prayer": "Lord, I believe, but I struggle; meet me in the middle of my doubt."
    }
  },
  {
    "date": "2026-01-19",
    "theme": "Silent Strength",
    "morning": {
      "title": "Light of the World",
      "verse_ref": "John 8:12",
      "verse_text": "I am the light of the world. Whoever follows Me will never walk in darkness.",
      "heart_picture": "Like a lamp walking ahead of you on a rough road at night.",
      "silent_soul_meaning": "Following Jesus does not mean life is easy, but it means you are never without light.",
      "prayer": "Jesus, be my light today in every dark place."
    },
    "night": {
      "title": "Walk as Children of Light",
      "verse_ref": "Ephesians 5:8",
      "verse_text": "Now you are light in the Lord. Live as children of light.",
      "heart_picture": "Like changing from wearing dark clothes to bright clothes that everyone can see.",
      "silent_soul_meaning": "Your life is a quiet message; let it shine with honesty, purity, and love.",
      "prayer": "Lord, let my life reflect Your light, even when nobody is watching."
    }
  },
  {
    "date": "2026-01-20",
    "theme": "Silent Strength",
    "morning": {
      "title": "Search Me, O God",
      "verse_ref": "Psalm 139:23-24",
      "verse_text": "Search me, God, and know my heart... lead me in the way everlasting.",
      "heart_picture": "Like opening all the rooms in your house and letting a kind inspector look around.",
      "silent_soul_meaning": "God already sees everything; the courage is in letting Him show you what needs to change.",
      "prayer": "Lord, point out anything in me that is not pleasing to You and lead me forward."
    },
    "night": {
      "title": "Run with Endurance",
      "verse_ref": "Hebrews 12:1",
      "verse_text": "Let us run with perseverance the race marked out for us.",
      "heart_picture": "Like removing heavy weights from your feet so you can finally run free.",
      "silent_soul_meaning": "Some things must be laid down if you will finish the race God gave you.",
      "prayer": "Lord, help me drop the weights that slow me down and keep moving with You."
    }
  },
  {
    "date": "2026-01-21",
    "theme": "Silent Strength",
    "morning": {
      "title": "Glory in Suffering",
      "verse_ref": "Romans 5:3-4",
      "verse_text": "We glory in our sufferings, because suffering produces perseverance; perseverance, character; and character, hope.",
      "heart_picture": "Like pressure turning plain coal into a diamond over time.",
      "silent_soul_meaning": "Your pain is not pointless; God is shaping strength and hope inside you.",
      "prayer": "Lord, use my struggles to grow real character and deep hope in me."
    },
    "night": {
      "title": "Joy in Trials",
      "verse_ref": "James 1:2-3",
      "verse_text": "Consider it pure joy when you face trials... because you know that the testing of your faith produces perseverance.",
      "heart_picture": "Like training muscles that hurt now but make you stronger later.",
      "silent_soul_meaning": "You do not have to enjoy pain, but you can value what God grows through it.",
      "prayer": "Lord, give me honest joy, not fake smiles, as You strengthen my faith."
    }
  },
  {
    "date": "2026-01-22",
    "theme": "Silent Strength",
    "morning": {
      "title": "Under the Shadow of the Almighty",
      "verse_ref": "Psalm 91:1-2",
      "verse_text": "Whoever dwells in the shelter of the Most High will rest in the shadow of the Almighty.",
      "heart_picture": "Like sitting under a big tree when the sun is too hot.",
      "silent_soul_meaning": "God’s presence is a real covering, not just a church word.",
      "prayer": "Lord, keep me under Your shadow today; be my refuge and fortress."
    },
    "night": {
      "title": "Not a Spirit of Fear",
      "verse_ref": "2 Timothy 1:7",
      "verse_text": "God gave us a spirit not of fear but of power, love and self-control.",
      "heart_picture": "Like changing an old battery that made the light dim for a new, strong one.",
      "silent_soul_meaning": "Fear is not your true identity; God’s Spirit inside you is strong and steady.",
      "prayer": "Lord, replace my fear reactions with Your power, love, and self-control."
    }
  },
  {
    "date": "2026-01-23",
    "theme": "Silent Strength",
    "morning": {
      "title": "When You Pass Through the Waters",
      "verse_ref": "Isaiah 43:2",
      "verse_text": "When you pass through the waters, I will be with you.",
      "heart_picture": "Like someone holding your hand while you cross a strong river.",
      "silent_soul_meaning": "God does not promise no deep water; He promises you will not face it alone.",
      "prayer": "Lord, stay with me in every deep and difficult place today."
    },
    "night": {
      "title": "Faith Tested by Fire",
      "verse_ref": "1 Peter 1:6-7",
      "verse_text": "You have had to suffer grief in all kinds of trials... so that the proven genuineness of your faith may result in praise.",
      "heart_picture": "Like gold being heated so the dirt can rise and be removed.",
      "silent_soul_meaning": "God is not burning you to destroy you, but to purify what is real in you.",
      "prayer": "Lord, use the fire of this season to make my faith real and pure."
    }
  },
  {
    "date": "2026-01-24",
    "theme": "Silent Strength",
    "morning": {
      "title": "I Keep My Eyes Always on the Lord",
      "verse_ref": "Psalm 16:8",
      "verse_text": "I keep my eyes always on the LORD. With Him at my right hand, I will not be shaken.",
      "heart_picture": "Like fixing your gaze on a steady point while the ground moves.",
      "silent_soul_meaning": "Focusing on God does not stop problems but keeps your heart from collapsing.",
      "prayer": "Lord, help me keep my eyes on You, not on the chaos."
    },
    "night": {
      "title": "Strength for All Endurance",
      "verse_ref": "Colossians 1:11",
      "verse_text": "Being strengthened with all power according to His glorious might so that you may have great endurance and patience.",
      "heart_picture": "Like fuel in a car that lets it keep going on a long journey.",
      "silent_soul_meaning": "Endurance is not willpower alone; it is God’s power working inside you.",
      "prayer": "Lord, fill me with strength to endure and be patient in this season."
    }
  },
  {
    "date": "2026-01-25",
    "theme": "Silent Strength",
    "morning": {
      "title": "Nothing Is Impossible with God",
      "verse_ref": "Luke 1:37",
      "verse_text": "No word from God will ever fail.",
      "heart_picture": "Like a seed that looks small but grows into a strong tree.",
      "silent_soul_meaning": "What looks impossible to you is not impossible to the God who speaks.",
      "prayer": "Lord, help me believe Your word over my fear and logic."
    },
    "night": {
      "title": "Light Shines in the Darkness",
      "verse_ref": "John 1:5",
      "verse_text": "The light shines in the darkness, and the darkness has not overcome it.",
      "heart_picture": "Like one candle that changes the whole room.",
      "silent_soul_meaning": "Darkness is loud, but it is not final; God’s light still wins.",
      "prayer": "Jesus, let Your light shine in every dark corner of my heart and home."
    }
  },
  {
    "date": "2026-01-26",
    "theme": "Silent Strength",
    "morning": {
      "title": "God Is the Strength of My Heart",
      "verse_ref": "Psalm 73:26",
      "verse_text": "My flesh and my heart may fail, but God is the strength of my heart.",
      "heart_picture": "Like a backup battery that turns on when the first one dies.",
      "silent_soul_meaning": "When your body and emotions crash, God remains steady inside you.",
      "prayer": "Lord, be the strength of my heart when my own strength fails."
    },
    "night": {
      "title": "No More Tears One Day",
      "verse_ref": "Revelation 21:4",
      "verse_text": "He will wipe every tear from their eyes.",
      "heart_picture": "Like a final morning with no more funeral clothes and no more hospitals.",
      "silent_soul_meaning": "This pain is not the last chapter; God has written a future with no more tears.",
      "prayer": "Lord, keep my hope alive for the day when You wipe away all tears."
    }
  },
  {
    "date": "2026-01-27",
    "theme": "Silent Strength",
    "morning": {
      "title": "No Condemnation",
      "verse_ref": "Romans 8:1",
      "verse_text": "There is now no condemnation for those who are in Christ Jesus.",
      "heart_picture": "Like a judge tearing up the guilty paper and declaring you free.",
      "silent_soul_meaning": "The enemy may accuse you, but God does not condemn you in Christ.",
      "prayer": "Lord, help me live from Your forgiveness, not from shame."
    },
    "night": {
      "title": "Life to the Full",
      "verse_ref": "John 10:10",
      "verse_text": "I came that they may have life, and have it to the full.",
      "heart_picture": "Like a cup not only filled but running over.",
      "silent_soul_meaning": "Jesus did not call you to just survive; He is growing a full, meaningful life in you.",
      "prayer": "Jesus, show me what real, full life looks like with You."
    }
  },
  {
    "date": "2026-01-28",
    "theme": "Silent Strength",
    "morning": {
      "title": "Words That Please God",
      "verse_ref": "Psalm 19:14",
      "verse_text": "May the words of my mouth and the meditation of my heart be pleasing in Your sight.",
      "heart_picture": "Like checking a letter before sending it to someone important.",
      "silent_soul_meaning": "Your silent thoughts and spoken words are both seen by God.",
      "prayer": "Lord, clean my thoughts and my words today so they honor You."
    },
    "night": {
      "title": "Speak Grace",
      "verse_ref": "Ephesians 4:29",
      "verse_text": "Do not let any unwholesome talk come out of your mouths, but only what is helpful.",
      "heart_picture": "Like choosing clean water instead of dirty water to give a thirsty friend.",
      "silent_soul_meaning": "Every word can either heal or harm; God calls you to speak healing.",
      "prayer": "Lord, forgive careless words and teach me to speak life."
    }
  },
  {
    "date": "2026-01-29",
    "theme": "Silent Strength",
    "morning": {
      "title": "Guard Your Heart",
      "verse_ref": "Proverbs 4:23",
      "verse_text": "Above all else, guard your heart, for everything you do flows from it.",
      "heart_picture": "Like putting a strong gate in front of a garden so weeds cannot easily enter.",
      "silent_soul_meaning": "You must be careful what you allow into your inner life; it will shape your actions.",
      "prayer": "Lord, help me guard my heart from lies, bitterness and fear today."
    },
    "night": {
      "title": "Take Every Thought Captive",
      "verse_ref": "2 Corinthians 10:5",
      "verse_text": "We take captive every thought to make it obedient to Christ.",
      "heart_picture": "Like stopping a stranger at the door and asking, “Who sent you?”",
      "silent_soul_meaning": "Not every thought is true; God gives you authority to challenge and reject lies.",
      "prayer": "Lord, help me catch and reject thoughts that do not agree with Your truth."
    }
  },
  {
    "date": "2026-01-30",
    "theme": "Silent Strength",
    "morning": {
      "title": "Number Our Days",
      "verse_ref": "Psalm 90:12",
      "verse_text": "Teach us to number our days, that we may gain a heart of wisdom.",
      "heart_picture": "Like counting each coin carefully so you spend it on what matters.",
      "silent_soul_meaning": "Your time on earth is limited; wisdom is choosing not to waste it.",
      "prayer": "Lord, remind me that my time is precious and help me use it well today."
    },
    "night": {
      "title": "Make the Most of Every Opportunity",
      "verse_ref": "Ephesians 5:15-16",
      "verse_text": "Be careful how you live... making the most of every opportunity.",
      "heart_picture": "Like catching a bus before it leaves instead of missing it again and again.",
      "silent_soul_meaning": "God gives open doors; you still must choose to walk through them.",
      "prayer": "Lord, show me the opportunities You gave me today and help me not to sleep on them."
    }
  },
  {
    "date": "2026-01-31",
    "theme": "Silent Strength",
    "morning": {
      "title": "Hold Fast to Hope",
      "verse_ref": "Hebrews 10:23",
      "verse_text": "Let us hold unswervingly to the hope we profess, for He who promised is faithful.",
      "heart_picture": "Like gripping a strong rope while the wind pushes hard.",
      "silent_soul_meaning": "Your hope is not in your feelings, but in a God who keeps His word.",
      "prayer": "Lord, help me hold on to Your promises when I feel like letting go."
    },
    "night": {
      "title": "He Is Able to Keep You",
      "verse_ref": "Jude 1:24",
      "verse_text": "To Him who is able to keep you from stumbling.",
      "heart_picture": "Like a strong hand holding your arm so you do not fall off a narrow path.",
      "silent_soul_meaning": "You are not keeping yourself alone; God is actively keeping you.",
      "prayer": "Lord, as this month closes, keep me from falling and carry me into the next season."
    }
  }
]
