[
  {
    "date": "2025-12-01",
    "type": "night",
    "verse_ref": "Luke 2:7",
    "verse_text": "She gave birth to her firstborn son… and laid Him in a manger, because there was no room for them in the inn.",
    "reflection": "She gave birth to her firstborn son… and laid Him in a manger, because there was no room for them in the inn. This reminds me that prepare him room is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal prepare him room in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-02",
    "type": "night",
    "verse_ref": "Luke 1:37",
    "verse_text": "For with God nothing shall be impossible.",
    "reflection": "For with God nothing shall be impossible. This reminds me that promise fulfilled is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal promise fulfilled in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-03",
    "type": "night",
    "verse_ref": "John 1:14",
    "verse_text": "The Word became flesh and made His home among us. We have seen His glory.",
    "reflection": "The Word became flesh and made His home among us. We have seen His glory. This reminds me that the word became flesh is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the word became flesh in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-04",
    "type": "night",
    "verse_ref": "Matthew 1:23",
    "verse_text": "They will call Him Emmanuel, which means 'God with us.'",
    "reflection": "They will call Him Emmanuel, which means 'God with us.' This reminds me that emmanuel — god with us is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal emmanuel — god with us in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-05",
    "type": "night",
    "verse_ref": "John 1:5",
    "verse_text": "The light shines in the darkness, and the darkness has not overcome it.",
    "reflection": "The light shines in the darkness, and the darkness has not overcome it. This reminds me that the light shines is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the light shines in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-06",
    "type": "night",
    "verse_ref": "Luke 2:10–11",
    "verse_text": "I bring you good news that will cause great joy for all the people.",
    "reflection": "I bring you good news that will cause great joy for all the people. This reminds me that joy to the world is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal joy to the world in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-07",
    "type": "night",
    "verse_ref": "Luke 2:14",
    "verse_text": "Glory to God in the highest heaven, and on earth peace to those on whom His favor rests.",
    "reflection": "Glory to God in the highest heaven, and on earth peace to those on whom His favor rests. This reminds me that glory to god in the highest is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal glory to god in the highest in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-08",
    "type": "night",
    "verse_ref": "Luke 2:17–18",
    "verse_text": "The shepherds spread the word concerning what had been told them about this child.",
    "reflection": "The shepherds spread the word concerning what had been told them about this child. This reminds me that shepherds rejoiced is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal shepherds rejoiced in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-09",
    "type": "night",
    "verse_ref": "Matthew 2:11",
    "verse_text": "They bowed down and worshiped Him and presented Him with gifts of gold, frankincense, and myrrh.",
    "reflection": "They bowed down and worshiped Him and presented Him with gifts of gold, frankincense, and myrrh. This reminds me that gifts of worship is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal gifts of worship in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-10",
    "type": "night",
    "verse_ref": "Matthew 2:9–10",
    "verse_text": "The star went ahead of them until it stopped over the place where the child was.",
    "reflection": "The star went ahead of them until it stopped over the place where the child was. This reminds me that following his star is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal following his star in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-11",
    "type": "night",
    "verse_ref": "Isaiah 9:6",
    "verse_text": "For to us a child is born, to us a son is given… and He will be called Prince of Peace.",
    "reflection": "For to us a child is born, to us a son is given… and He will be called Prince of Peace. This reminds me that peace on earth is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal peace on earth in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-12",
    "type": "night",
    "verse_ref": "Isaiah 42:6",
    "verse_text": "I will make you to be a covenant for the people and a light for the nations.",
    "reflection": "I will make you to be a covenant for the people and a light for the nations. This reminds me that hope of the nations is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal hope of the nations in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-13",
    "type": "night",
    "verse_ref": "John 3:16",
    "verse_text": "For God so loved the world that He gave His one and only Son.",
    "reflection": "For God so loved the world that He gave His one and only Son. This reminds me that god’s gift of love is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal god’s gift of love in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-14",
    "type": "night",
    "verse_ref": "Philippians 2:7–8",
    "verse_text": "He made Himself nothing… becoming obedient to death, even death on a cross.",
    "reflection": "He made Himself nothing… becoming obedient to death, even death on a cross. This reminds me that the humble king is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the humble king in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-15",
    "type": "night",
    "verse_ref": "Luke 1:38",
    "verse_text": "I am the Lord’s servant. May your word to me be fulfilled.",
    "reflection": "I am the Lord’s servant. May your word to me be fulfilled. This reminds me that faith like mary is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal faith like mary in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-16",
    "type": "night",
    "verse_ref": "John 10:11",
    "verse_text": "I am the good shepherd. The good shepherd lays down His life for the sheep.",
    "reflection": "I am the good shepherd. The good shepherd lays down His life for the sheep. This reminds me that the good shepherd is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the good shepherd in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-17",
    "type": "night",
    "verse_ref": "Matthew 5:14–16",
    "verse_text": "You are the light of the world… let your light shine before others.",
    "reflection": "You are the light of the world… let your light shine before others. This reminds me that light to the world is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal light to the world in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-18",
    "type": "night",
    "verse_ref": "Galatians 4:4–5",
    "verse_text": "When the fullness of time had come, God sent His Son… to redeem those under the law.",
    "reflection": "When the fullness of time had come, God sent His Son… to redeem those under the law. This reminds me that jesus our redeemer is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal jesus our redeemer in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-19",
    "type": "night",
    "verse_ref": "Matthew 1:21",
    "verse_text": "You are to give Him the name Jesus, because He will save His people from their sins.",
    "reflection": "You are to give Him the name Jesus, because He will save His people from their sins. This reminds me that born to save is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal born to save in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-20",
    "type": "night",
    "verse_ref": "Zechariah 9:9",
    "verse_text": "See, your king comes to you, righteous and victorious, lowly and riding on a donkey.",
    "reflection": "See, your king comes to you, righteous and victorious, lowly and riding on a donkey. This reminds me that the king has come is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the king has come in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-21",
    "type": "night",
    "verse_ref": "Mark 1:3",
    "verse_text": "Prepare the way for the Lord, make straight paths for Him.",
    "reflection": "Prepare the way for the Lord, make straight paths for Him. This reminds me that hearts prepared is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal hearts prepared in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-22",
    "type": "night",
    "verse_ref": "Colossians 3:15",
    "verse_text": "Let the peace of Christ rule in your hearts.",
    "reflection": "Let the peace of Christ rule in your hearts. This reminds me that peace within is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal peace within in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-23",
    "type": "night",
    "verse_ref": "Psalm 95:6",
    "verse_text": "Come, let us bow down in worship, let us kneel before the Lord our Maker.",
    "reflection": "Come, let us bow down in worship, let us kneel before the Lord our Maker. This reminds me that worship and wonder is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal worship and wonder in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-24",
    "type": "night",
    "verse_ref": "Philippians 4:5",
    "verse_text": "Let your gentleness be evident to all. The Lord is near.",
    "reflection": "Let your gentleness be evident to all. The Lord is near. This reminds me that the lord is near is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal the lord is near in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-25",
    "type": "night",
    "verse_ref": "Matthew 28:20",
    "verse_text": "Surely I am with you always, to the very end of the age.",
    "reflection": "Surely I am with you always, to the very end of the age. This reminds me that god with us always is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal god with us always in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-26",
    "type": "night",
    "verse_ref": "Revelation 5:12",
    "verse_text": "Worthy is the Lamb who was slain, to receive power and wealth and wisdom and strength.",
    "reflection": "Worthy is the Lamb who was slain, to receive power and wealth and wisdom and strength. This reminds me that heaven’s song is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal heaven’s song in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-27",
    "type": "night",
    "verse_ref": "John 8:12",
    "verse_text": "I am the light of the world. Whoever follows Me will never walk in darkness.",
    "reflection": "I am the light of the world. Whoever follows Me will never walk in darkness. This reminds me that light of the world is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal light of the world in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-28",
    "type": "night",
    "verse_ref": "2 Corinthians 4:6",
    "verse_text": "God made His light shine in our hearts to give us the knowledge of His glory in Christ.",
    "reflection": "God made His light shine in our hearts to give us the knowledge of His glory in Christ. This reminds me that glory revealed is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal glory revealed in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-29",
    "type": "night",
    "verse_ref": "Revelation 19:16",
    "verse_text": "On His robe and on His thigh He has this name written: KING OF KINGS AND LORD OF LORDS.",
    "reflection": "On His robe and on His thigh He has this name written: KING OF KINGS AND LORD OF LORDS. This reminds me that crown him lord is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal crown him lord in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  },
  {
    "date": "2025-12-30",
    "type": "night",
    "verse_ref": "2 Corinthians 3:18",
    "verse_text": "We all, who reflect the Lord’s glory, are being transformed into His image with ever-increasing glory.",
    "reflection": "We all, who reflect the Lord’s glory, are being transformed into His image with ever-increasing glory. This reminds me that from glory to glory is possible today through God’s presence. Tonight, I RELEASE every weight and SURRENDER fully to the Lord's covering.",
    "prayer": "Father, as I rest, seal from glory to glory in my heart and renew my strength for tomorrow. 🙏 I lay it ALL down and yield completely to You, Lord."
  }
]