[
  {
    "date": "2025-12-01",
    "type": "morning",
    "title": "Prepare Him Room",
    "verse_ref": "Luke 2:7",
    "verse_text": "She gave birth to her firstborn son… and laid Him in a manger, because there was no room for them in the inn.",
    "encouragement_intro": "This reminds me that prepare him room is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PREPARE HIM ROOM.",
    "point2": "💫 I REFUSE to let anything steal God’s PREPARE HIM ROOM from my life.",
    "point3": "💫 I WILL live and speak PREPARE HIM ROOM boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PREPARE HIM ROOM with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 2:7. Help me walk in prepare him room today."
  },
  {
    "date": "2025-12-02",
    "type": "morning",
    "title": "Promise Fulfilled",
    "verse_ref": "Luke 1:37",
    "verse_text": "For with God nothing shall be impossible.",
    "encouragement_intro": "This reminds me that promise fulfilled is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PROMISE FULFILLED.",
    "point2": "💫 I REFUSE to let anything steal God’s PROMISE FULFILLED from my life.",
    "point3": "💫 I WILL live and speak PROMISE FULFILLED boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PROMISE FULFILLED with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 1:37. Help me walk in promise fulfilled today."
  },
  {
    "date": "2025-12-03",
    "type": "morning",
    "title": "The Word Became Flesh",
    "verse_ref": "John 1:14",
    "verse_text": "The Word became flesh and made His home among us. We have seen His glory.",
    "encouragement_intro": "This reminds me that the word became flesh is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE WORD BECAME FLESH.",
    "point2": "💫 I REFUSE to let anything steal God’s THE WORD BECAME FLESH from my life.",
    "point3": "💫 I WILL live and speak THE WORD BECAME FLESH boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE WORD BECAME FLESH with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 1:14. Help me walk in the word became flesh today."
  },
  {
    "date": "2025-12-04",
    "type": "morning",
    "title": "Emmanuel — God with Us",
    "verse_ref": "Matthew 1:23",
    "verse_text": "They will call Him Emmanuel, which means 'God with us.'",
    "encouragement_intro": "This reminds me that emmanuel — god with us is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in EMMANUEL — GOD WITH US.",
    "point2": "💫 I REFUSE to let anything steal God’s EMMANUEL — GOD WITH US from my life.",
    "point3": "💫 I WILL live and speak EMMANUEL — GOD WITH US boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry EMMANUEL — GOD WITH US with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 1:23. Help me walk in emmanuel — god with us today."
  },
  {
    "date": "2025-12-05",
    "type": "morning",
    "title": "The Light Shines",
    "verse_ref": "John 1:5",
    "verse_text": "The light shines in the darkness, and the darkness has not overcome it.",
    "encouragement_intro": "This reminds me that the light shines is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE LIGHT SHINES.",
    "point2": "💫 I REFUSE to let anything steal God’s THE LIGHT SHINES from my life.",
    "point3": "💫 I WILL live and speak THE LIGHT SHINES boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE LIGHT SHINES with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 1:5. Help me walk in the light shines today."
  },
  {
    "date": "2025-12-06",
    "type": "morning",
    "title": "Joy to the World",
    "verse_ref": "Luke 2:10–11",
    "verse_text": "I bring you good news that will cause great joy for all the people.",
    "encouragement_intro": "This reminds me that joy to the world is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in JOY TO THE WORLD.",
    "point2": "💫 I REFUSE to let anything steal God’s JOY TO THE WORLD from my life.",
    "point3": "💫 I WILL live and speak JOY TO THE WORLD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry JOY TO THE WORLD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 2:10–11. Help me walk in joy to the world today."
  },
  {
    "date": "2025-12-07",
    "type": "morning",
    "title": "Glory to God in the Highest",
    "verse_ref": "Luke 2:14",
    "verse_text": "Glory to God in the highest heaven, and on earth peace to those on whom His favor rests.",
    "encouragement_intro": "This reminds me that glory to god in the highest is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GLORY TO GOD IN THE HIGHEST.",
    "point2": "💫 I REFUSE to let anything steal God’s GLORY TO GOD IN THE HIGHEST from my life.",
    "point3": "💫 I WILL live and speak GLORY TO GOD IN THE HIGHEST boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GLORY TO GOD IN THE HIGHEST with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 2:14. Help me walk in glory to god in the highest today."
  },
  {
    "date": "2025-12-08",
    "type": "morning",
    "title": "Shepherds Rejoiced",
    "verse_ref": "Luke 2:17–18",
    "verse_text": "The shepherds spread the word concerning what had been told them about this child.",
    "encouragement_intro": "This reminds me that shepherds rejoiced is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in SHEPHERDS REJOICED.",
    "point2": "💫 I REFUSE to let anything steal God’s SHEPHERDS REJOICED from my life.",
    "point3": "💫 I WILL live and speak SHEPHERDS REJOICED boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry SHEPHERDS REJOICED with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 2:17–18. Help me walk in shepherds rejoiced today."
  },
  {
    "date": "2025-12-09",
    "type": "morning",
    "title": "Gifts of Worship",
    "verse_ref": "Matthew 2:11",
    "verse_text": "They bowed down and worshiped Him and presented Him with gifts of gold, frankincense, and myrrh.",
    "encouragement_intro": "This reminds me that gifts of worship is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GIFTS OF WORSHIP.",
    "point2": "💫 I REFUSE to let anything steal God’s GIFTS OF WORSHIP from my life.",
    "point3": "💫 I WILL live and speak GIFTS OF WORSHIP boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GIFTS OF WORSHIP with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 2:11. Help me walk in gifts of worship today."
  },
  {
    "date": "2025-12-10",
    "type": "morning",
    "title": "Following His Star",
    "verse_ref": "Matthew 2:9–10",
    "verse_text": "The star went ahead of them until it stopped over the place where the child was.",
    "encouragement_intro": "This reminds me that following his star is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in FOLLOWING HIS STAR.",
    "point2": "💫 I REFUSE to let anything steal God’s FOLLOWING HIS STAR from my life.",
    "point3": "💫 I WILL live and speak FOLLOWING HIS STAR boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry FOLLOWING HIS STAR with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 2:9–10. Help me walk in following his star today."
  },
  {
    "date": "2025-12-11",
    "type": "morning",
    "title": "Peace on Earth",
    "verse_ref": "Isaiah 9:6",
    "verse_text": "For to us a child is born, to us a son is given… and He will be called Prince of Peace.",
    "encouragement_intro": "This reminds me that peace on earth is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PEACE ON EARTH.",
    "point2": "💫 I REFUSE to let anything steal God’s PEACE ON EARTH from my life.",
    "point3": "💫 I WILL live and speak PEACE ON EARTH boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PEACE ON EARTH with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Isaiah 9:6. Help me walk in peace on earth today."
  },
  {
    "date": "2025-12-12",
    "type": "morning",
    "title": "Hope of the Nations",
    "verse_ref": "Isaiah 42:6",
    "verse_text": "I will make you to be a covenant for the people and a light for the nations.",
    "encouragement_intro": "This reminds me that hope of the nations is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HOPE OF THE NATIONS.",
    "point2": "💫 I REFUSE to let anything steal God’s HOPE OF THE NATIONS from my life.",
    "point3": "💫 I WILL live and speak HOPE OF THE NATIONS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HOPE OF THE NATIONS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Isaiah 42:6. Help me walk in hope of the nations today."
  },
  {
    "date": "2025-12-13",
    "type": "morning",
    "title": "God’s Gift of Love",
    "verse_ref": "John 3:16",
    "verse_text": "For God so loved the world that He gave His one and only Son.",
    "encouragement_intro": "This reminds me that god’s gift of love is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GOD’S GIFT OF LOVE.",
    "point2": "💫 I REFUSE to let anything steal God’s GOD’S GIFT OF LOVE from my life.",
    "point3": "💫 I WILL live and speak GOD’S GIFT OF LOVE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GOD’S GIFT OF LOVE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 3:16. Help me walk in god’s gift of love today."
  },
  {
    "date": "2025-12-14",
    "type": "morning",
    "title": "The Humble King",
    "verse_ref": "Philippians 2:7–8",
    "verse_text": "He made Himself nothing… becoming obedient to death, even death on a cross.",
    "encouragement_intro": "This reminds me that the humble king is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE HUMBLE KING.",
    "point2": "💫 I REFUSE to let anything steal God’s THE HUMBLE KING from my life.",
    "point3": "💫 I WILL live and speak THE HUMBLE KING boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE HUMBLE KING with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Philippians 2:7–8. Help me walk in the humble king today."
  },
  {
    "date": "2025-12-15",
    "type": "morning",
    "title": "Faith Like Mary",
    "verse_ref": "Luke 1:38",
    "verse_text": "I am the Lord’s servant. May your word to me be fulfilled.",
    "encouragement_intro": "This reminds me that faith like mary is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in FAITH LIKE MARY.",
    "point2": "💫 I REFUSE to let anything steal God’s FAITH LIKE MARY from my life.",
    "point3": "💫 I WILL live and speak FAITH LIKE MARY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry FAITH LIKE MARY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Luke 1:38. Help me walk in faith like mary today."
  },
  {
    "date": "2025-12-16",
    "type": "morning",
    "title": "The Good Shepherd",
    "verse_ref": "John 10:11",
    "verse_text": "I am the good shepherd. The good shepherd lays down His life for the sheep.",
    "encouragement_intro": "This reminds me that the good shepherd is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE GOOD SHEPHERD.",
    "point2": "💫 I REFUSE to let anything steal God’s THE GOOD SHEPHERD from my life.",
    "point3": "💫 I WILL live and speak THE GOOD SHEPHERD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE GOOD SHEPHERD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 10:11. Help me walk in the good shepherd today."
  },
  {
    "date": "2025-12-17",
    "type": "morning",
    "title": "Light to the World",
    "verse_ref": "Matthew 5:14–16",
    "verse_text": "You are the light of the world… let your light shine before others.",
    "encouragement_intro": "This reminds me that light to the world is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in LIGHT TO THE WORLD.",
    "point2": "💫 I REFUSE to let anything steal God’s LIGHT TO THE WORLD from my life.",
    "point3": "💫 I WILL live and speak LIGHT TO THE WORLD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry LIGHT TO THE WORLD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 5:14–16. Help me walk in light to the world today."
  },
  {
    "date": "2025-12-18",
    "type": "morning",
    "title": "Jesus Our Redeemer",
    "verse_ref": "Galatians 4:4–5",
    "verse_text": "When the fullness of time had come, God sent His Son… to redeem those under the law.",
    "encouragement_intro": "This reminds me that jesus our redeemer is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in JESUS OUR REDEEMER.",
    "point2": "💫 I REFUSE to let anything steal God’s JESUS OUR REDEEMER from my life.",
    "point3": "💫 I WILL live and speak JESUS OUR REDEEMER boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry JESUS OUR REDEEMER with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Galatians 4:4–5. Help me walk in jesus our redeemer today."
  },
  {
    "date": "2025-12-19",
    "type": "morning",
    "title": "Born to Save",
    "verse_ref": "Matthew 1:21",
    "verse_text": "You are to give Him the name Jesus, because He will save His people from their sins.",
    "encouragement_intro": "This reminds me that born to save is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in BORN TO SAVE.",
    "point2": "💫 I REFUSE to let anything steal God’s BORN TO SAVE from my life.",
    "point3": "💫 I WILL live and speak BORN TO SAVE boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry BORN TO SAVE with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 1:21. Help me walk in born to save today."
  },
  {
    "date": "2025-12-20",
    "type": "morning",
    "title": "The King Has Come",
    "verse_ref": "Zechariah 9:9",
    "verse_text": "See, your king comes to you, righteous and victorious, lowly and riding on a donkey.",
    "encouragement_intro": "This reminds me that the king has come is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE KING HAS COME.",
    "point2": "💫 I REFUSE to let anything steal God’s THE KING HAS COME from my life.",
    "point3": "💫 I WILL live and speak THE KING HAS COME boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE KING HAS COME with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Zechariah 9:9. Help me walk in the king has come today."
  },
  {
    "date": "2025-12-21",
    "type": "morning",
    "title": "Hearts Prepared",
    "verse_ref": "Mark 1:3",
    "verse_text": "Prepare the way for the Lord, make straight paths for Him.",
    "encouragement_intro": "This reminds me that hearts prepared is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HEARTS PREPARED.",
    "point2": "💫 I REFUSE to let anything steal God’s HEARTS PREPARED from my life.",
    "point3": "💫 I WILL live and speak HEARTS PREPARED boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HEARTS PREPARED with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Mark 1:3. Help me walk in hearts prepared today."
  },
  {
    "date": "2025-12-22",
    "type": "morning",
    "title": "Peace Within",
    "verse_ref": "Colossians 3:15",
    "verse_text": "Let the peace of Christ rule in your hearts.",
    "encouragement_intro": "This reminds me that peace within is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in PEACE WITHIN.",
    "point2": "💫 I REFUSE to let anything steal God’s PEACE WITHIN from my life.",
    "point3": "💫 I WILL live and speak PEACE WITHIN boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry PEACE WITHIN with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Colossians 3:15. Help me walk in peace within today."
  },
  {
    "date": "2025-12-23",
    "type": "morning",
    "title": "Worship and Wonder",
    "verse_ref": "Psalm 95:6",
    "verse_text": "Come, let us bow down in worship, let us kneel before the Lord our Maker.",
    "encouragement_intro": "This reminds me that worship and wonder is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in WORSHIP AND WONDER.",
    "point2": "💫 I REFUSE to let anything steal God’s WORSHIP AND WONDER from my life.",
    "point3": "💫 I WILL live and speak WORSHIP AND WONDER boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry WORSHIP AND WONDER with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Psalm 95:6. Help me walk in worship and wonder today."
  },
  {
    "date": "2025-12-24",
    "type": "morning",
    "title": "The Lord Is Near",
    "verse_ref": "Philippians 4:5",
    "verse_text": "Let your gentleness be evident to all. The Lord is near.",
    "encouragement_intro": "This reminds me that the lord is near is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in THE LORD IS NEAR.",
    "point2": "💫 I REFUSE to let anything steal God’s THE LORD IS NEAR from my life.",
    "point3": "💫 I WILL live and speak THE LORD IS NEAR boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry THE LORD IS NEAR with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Philippians 4:5. Help me walk in the lord is near today."
  },
  {
    "date": "2025-12-25",
    "type": "morning",
    "title": "God With Us Always",
    "verse_ref": "Matthew 28:20",
    "verse_text": "Surely I am with you always, to the very end of the age.",
    "encouragement_intro": "This reminds me that god with us always is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GOD WITH US ALWAYS.",
    "point2": "💫 I REFUSE to let anything steal God’s GOD WITH US ALWAYS from my life.",
    "point3": "💫 I WILL live and speak GOD WITH US ALWAYS boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GOD WITH US ALWAYS with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Matthew 28:20. Help me walk in god with us always today."
  },
  {
    "date": "2025-12-26",
    "type": "morning",
    "title": "Heaven’s Song",
    "verse_ref": "Revelation 5:12",
    "verse_text": "Worthy is the Lamb who was slain, to receive power and wealth and wisdom and strength.",
    "encouragement_intro": "This reminds me that heaven’s song is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in HEAVEN’S SONG.",
    "point2": "💫 I REFUSE to let anything steal God’s HEAVEN’S SONG from my life.",
    "point3": "💫 I WILL live and speak HEAVEN’S SONG boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry HEAVEN’S SONG with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Revelation 5:12. Help me walk in heaven’s song today."
  },
  {
    "date": "2025-12-27",
    "type": "morning",
    "title": "Light of the World",
    "verse_ref": "John 8:12",
    "verse_text": "I am the light of the world. Whoever follows Me will never walk in darkness.",
    "encouragement_intro": "This reminds me that light of the world is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in LIGHT OF THE WORLD.",
    "point2": "💫 I REFUSE to let anything steal God’s LIGHT OF THE WORLD from my life.",
    "point3": "💫 I WILL live and speak LIGHT OF THE WORLD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry LIGHT OF THE WORLD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in John 8:12. Help me walk in light of the world today."
  },
  {
    "date": "2025-12-28",
    "type": "morning",
    "title": "Glory Revealed",
    "verse_ref": "2 Corinthians 4:6",
    "verse_text": "God made His light shine in our hearts to give us the knowledge of His glory in Christ.",
    "encouragement_intro": "This reminds me that glory revealed is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in GLORY REVEALED.",
    "point2": "💫 I REFUSE to let anything steal God’s GLORY REVEALED from my life.",
    "point3": "💫 I WILL live and speak GLORY REVEALED boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry GLORY REVEALED with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Corinthians 4:6. Help me walk in glory revealed today."
  },
  {
    "date": "2025-12-29",
    "type": "morning",
    "title": "Crown Him Lord",
    "verse_ref": "Revelation 19:16",
    "verse_text": "On His robe and on His thigh He has this name written: KING OF KINGS AND LORD OF LORDS.",
    "encouragement_intro": "This reminds me that crown him lord is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in CROWN HIM LORD.",
    "point2": "💫 I REFUSE to let anything steal God’s CROWN HIM LORD from my life.",
    "point3": "💫 I WILL live and speak CROWN HIM LORD boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry CROWN HIM LORD with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in Revelation 19:16. Help me walk in crown him lord today."
  },
  {
    "date": "2025-12-30",
    "type": "morning",
    "title": "From Glory to Glory",
    "verse_ref": "2 Corinthians 3:18",
    "verse_text": "We all, who reflect the Lord’s glory, are being transformed into His image with ever-increasing glory.",
    "encouragement_intro": "This reminds me that from glory to glory is possible today through God’s presence.",
    "point1": "💫 I DECLARE today I will walk in FROM GLORY TO GLORY.",
    "point2": "💫 I REFUSE to let anything steal God’s FROM GLORY TO GLORY from my life.",
    "point3": "💫 I WILL live and speak FROM GLORY TO GLORY boldly as my testimony.",
    "closing": "🔥 I WILL rise and carry FROM GLORY TO GLORY with power and conviction today!",
    "prayer": "Lord, thank You for Your Word in 2 Corinthians 3:18. Help me walk in from glory to glory today."
  }
]