[
  {"type":"night","date":"2025-09-01","verse_ref":"Psalm 4:8","verse_text":"In peace I will lie down and sleep, for you alone, Lord, make me dwell in safety.","reflection":"Lay down the day’s weight. Safety is not in control—it’s in His care.","prayer":"Lord, I surrender tonight. Guard my rest and quiet my heart. Amen."},
  {"type":"night","date":"2025-09-02","verse_ref":"Philippians 4:6-7","verse_text":"Do not be anxious about anything... and the peace of God will guard your hearts and minds.","reflection":"Release every anxious loop to God; peace is better at guarding than worry.","prayer":"Father, I hand You every concern. Guard my mind with Your peace. Amen."},
  {"type":"night","date":"2025-09-03","verse_ref":"Matthew 11:28","verse_text":"Come to me, all you who are weary and burdened, and I will give you rest.","reflection":"Rest is a person before it is a place; come to Jesus with the day.","prayer":"Jesus, I come. I exchange my burdens for Your rest. Amen."},
  {"type":"night","date":"2025-09-04","verse_ref":"1 Peter 5:7","verse_text":"Cast all your anxiety on him because he cares for you.","reflection":"Surrender is not defeat; it is trust in the One who cares.","prayer":"Lord, I cast, not carry. Take all that weighs me down. Amen."},
  {"type":"night","date":"2025-09-05","verse_ref":"Psalm 23:1-3","verse_text":"He makes me lie down in green pastures... He restores my soul.","reflection":"Let the Shepherd lead you from striving to stillness.","prayer":"Shepherd of my soul, restore me as I rest in You. Amen."},
  {"type":"night","date":"2025-09-06","verse_ref":"Isaiah 26:3","verse_text":"You will keep in perfect peace those whose minds are steadfast, because they trust in you.","reflection":"Fix your mind, not on outcomes, but on the One who holds them.","prayer":"God, fix my thoughts on You and keep me in perfect peace. Amen."},
  {"type":"night","date":"2025-09-07","verse_ref":"Psalm 121:3-4","verse_text":"He who watches over Israel will neither slumber nor sleep.","reflection":"Since He stays awake, you don’t have to.","prayer":"Watcher of my life, I sleep while You keep watch. Amen."},
  {"type":"night","date":"2025-09-08","verse_ref":"Lamentations 3:22-23","verse_text":"His mercies are new every morning.","reflection":"End the day with gratitude—mercy will meet you at dawn.","prayer":"Thank You for mercy past and mercy ahead. Amen."},
  {"type":"night","date":"2025-09-09","verse_ref":"Proverbs 3:24","verse_text":"When you lie down, you will not be afraid; your sleep will be sweet.","reflection":"Sweet sleep grows in surrendered hearts.","prayer":"Lord, remove fear and give me sweet rest. Amen."},
  {"type":"night","date":"2025-09-10","verse_ref":"Psalm 46:10","verse_text":"Be still, and know that I am God.","reflection":"Stillness is the doorway to knowing; slow your soul.","prayer":"God, I quiet myself before You. Re-center me in Your presence. Amen."},

  {"type":"night","date":"2025-09-11","verse_ref":"John 14:27","verse_text":"My peace I give you.","reflection":"His peace isn’t borrowed—it’s given. Receive it.","prayer":"Prince of Peace, fill the room of my heart. Amen."},
  {"type":"night","date":"2025-09-12","verse_ref":"Psalm 139:23-24","verse_text":"Search me, God, and know my heart... lead me in the way everlasting.","reflection":"Let God sift your motives; surrender what He reveals.","prayer":"Search me, Lord. Cleanse and lead me tonight. Amen."},
  {"type":"night","date":"2025-09-13","verse_ref":"1 John 1:9","verse_text":"If we confess our sins, he is faithful and just to forgive us our sins.","reflection":"Confession clears the sky; forgiveness restores fellowship.","prayer":"Faithful God, I confess and receive Your cleansing. Amen."},
  {"type":"night","date":"2025-09-14","verse_ref":"Psalm 16:8","verse_text":"I keep my eyes always on the Lord. With him at my right hand, I will not be shaken.","reflection":"Fix your gaze—stability follows focus.","prayer":"Lord, hold me steady as I rest in You. Amen."},
  {"type":"night","date":"2025-09-15","verse_ref":"Hebrews 4:16","verse_text":"Approach God’s throne of grace with confidence...","reflection":"Grace is open tonight; bring your need honestly.","prayer":"Father, I come to Your throne for mercy and help. Amen."},
  {"type":"night","date":"2025-09-16","verse_ref":"Psalm 91:1-2","verse_text":"Whoever dwells in the shelter of the Most High will rest in the shadow of the Almighty.","reflection":"Rest happens under His shadow, not under pressure.","prayer":"Almighty, cover me. I dwell in Your shelter. Amen."},
  {"type":"night","date":"2025-09-17","verse_ref":"Matthew 6:34","verse_text":"Do not worry about tomorrow...","reflection":"Tomorrow is God’s; release it.","prayer":"Lord, I place tomorrow in Your hands and sleep in peace. Amen."},
  {"type":"night","date":"2025-09-18","verse_ref":"Psalm 62:1","verse_text":"Truly my soul finds rest in God; my salvation comes from him.","reflection":"Rest is found, not forced—find it in Him.","prayer":"God, let my soul rest only in You. Amen."},
  {"type":"night","date":"2025-09-19","verse_ref":"John 15:5","verse_text":"Apart from me you can do nothing.","reflection":"Release performance; remain in the Vine.","prayer":"Jesus, I abide in You. Work while I rest. Amen."},
  {"type":"night","date":"2025-09-20","verse_ref":"Psalm 3:5","verse_text":"I lie down and sleep; I wake again, because the Lord sustains me.","reflection":"Your waking is proof of His keeping; trust Him again.","prayer":"Sustainer, keep me through the night. Amen."},
  {"type":"night","date":"2025-09-21","verse_ref":"Romans 8:28","verse_text":"In all things God works for the good of those who love him.","reflection":"Release control; God is already weaving good.","prayer":"Father, I trust Your weaving hands. Amen."},
  {"type":"night","date":"2025-09-22","verse_ref":"Psalm 34:18","verse_text":"The LORD is close to the brokenhearted...","reflection":"Let Him be near to what hurts; invite comfort.","prayer":"Lord, be close; mend what is torn. Amen."},
  {"type":"night","date":"2025-09-23","verse_ref":"Isaiah 41:10","verse_text":"Do not fear, for I am with you... I will uphold you.","reflection":"Hands off fear, hands up in trust.","prayer":"Uphold me with Your righteous right hand. Amen."},
  {"type":"night","date":"2025-09-24","verse_ref":"Psalm 19:14","verse_text":"May the words of my mouth and the meditation of my heart be pleasing in your sight.","reflection":"Let the day’s residue be refined into worship.","prayer":"God, purify my thoughts and words as I rest. Amen."},
  {"type":"night","date":"2025-09-25","verse_ref":"1 Peter 1:5","verse_text":"Through faith you are shielded by God’s power...","reflection":"Your life is shielded; sleep within His defense.","prayer":"Shield me, Lord, and surround my home with peace. Amen."},
  {"type":"night","date":"2025-09-26","verse_ref":"Psalm 37:7","verse_text":"Be still before the Lord and wait patiently for him.","reflection":"Choose stillness over striving—wait without worry.","prayer":"Teach me to wait well, Lord. Amen."},
  {"type":"night","date":"2025-09-27","verse_ref":"Philippians 1:6","verse_text":"He who began a good work in you will carry it on to completion.","reflection":"Unfinished doesn’t mean uncertain—God is still working.","prayer":"Finish what You started in me, Lord. Amen."},
  {"type":"night","date":"2025-09-28","verse_ref":"Psalm 63:6","verse_text":"On my bed I remember you; I think of you through the watches of the night.","reflection":"Turn the night into worship and remembrance.","prayer":"I remember Your faithfulness and sing in my heart. Amen."},
  {"type":"night","date":"2025-09-29","verse_ref":"Jude 24","verse_text":"To him who is able to keep you from stumbling...","reflection":"He is able to keep you; rest in that ability, not yours.","prayer":"Keeper of my soul, hold me steady tonight. Amen."},
  {"type":"night","date":"2025-09-30","verse_ref":"Numbers 6:24-26","verse_text":"The Lord bless you and keep you; the Lord make his face shine on you... and give you peace.","reflection":"End this month under the blessing of His face shining upon you.","prayer":"Lord, bless and keep me; give me peace as I close this month. Amen."}
]
